[
  {
    "id": "1jvst3f",
    "title": "I don’t want to do it but I hate my life",
    "selftext": "My life situation is giving me so much stress and anxiety I want to die but I’m too scared. I feel so scared and alone I just want to be held. ",
    "score": 3,
    "upvotes": 3,
    "num_comments": 0,
    "created_datetime": "2025-04-10 08:17:36",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvssfh",
    "title": "I don’t want to live anymore, due to the constant hate I receive for existing.",
    "selftext": "I am an 18 year old trans girl, living on my own in the deep south US. Writing this at 4 am, crying, like I do every night. No matter where I go, or what I do, all I ever see is constant hatred towards me. I see it online, irl, with family, on signs and stickers. Knowing that half the world wants me dead for something I can’t control is incredibly depressing.\n\nI just hate being transgender so much… I no longer believe god is real, because if he was, he would at least have some sympathy, and not give me such an awful punishment. Every day feels like torture, just wanting to be comfortable in my own skin, suffering with severe gender dysphoria; since I was 12 years old. I guess thats not enough of a punishment though, and have all trans healthcare withheld from me. It’s illegal for me to even simply get HRT.\n\nThe best solution at this point would be to just give in to what the transphobes want, and kill myself. At least will know I made someone happy, by contributing to a statistic. ",
    "score": 2,
    "upvotes": 2,
    "num_comments": 0,
    "created_datetime": "2025-04-10 08:15:59",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvsomv",
    "title": "Why doesn’t anyone want to help me? am I not a human?",
    "selftext": "Am I inferior or something? I tried to love myself for years and finally achieved it, then society started to treat me like trash as if I was a subhuman, most humans are pure evil. I realised this brutal truth last year. A lot of people are cowards who try to boost their egos by making disadvantage people’s lives even more miserable.What do bullies gain when they disturb a person for whatever reason that is none of their business.What happened to humans being kind to each other,did it get forgotten or did it actually never exist and it was just a lie we were told when we were kids. I don’t wanna live in a society like this where everything is fake and cruel, I doubt anyone will even bother to comment on this post, but if you are reading this, thank you goodbye",
    "score": 2,
    "upvotes": 2,
    "num_comments": 0,
    "created_datetime": "2025-04-10 08:07:36",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvsn0n",
    "title": "Oxycodone",
    "selftext": "I have 80 mg of Oxycodone, if I've never taken opiates and have no tolerance, is that enough to OD on? For reference I'm 53kg/116lbs",
    "score": 1,
    "upvotes": 1,
    "num_comments": 0,
    "created_datetime": "2025-04-10 08:04:09",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvsllf",
    "title": "Nostalgia",
    "selftext": "Hello everyone, i've always had what is referred to as \"nostalgic depression\" as well as usual depression. Whenever I get a sense of nostalgia ranging from a smell, to a video, picture, music etc. Everytime I intake some form of nostalgia whatever it may be, I get suicidal thoughts. \n\n  \nI am looking for coping mechanisms others who suffer the same feeling have found to work. I've been a somewhat suicidal person since I was around 14 years old, I am 20 now. \n\nThese nostalgic depression episodes have always been a concern to me but today it hit really hard. I was driving home from work around 2 hours ago and I got a rush of nostalgia from a smell and a song that I haven't heard since I was around 10-12 and I immedietly flashed back to a distinct memory of mine when I was in the car with my mom and my sister and we were all singing the song at the top of our lungs. \n\n(Don't stop believin-Journey)\n\nI subconciously tried to crash, I had the gas peddle pinned and was heading straght for some trees. I didn't even notice but my face was covered in tears and my hands were gripping the wheel as if I were bracing for impact.  I'm not afraid of death, I would love to die, but I don't want to take my own life in fear of the pain it would cause my family. I believe in letting god decide when he is ready for me. I need to find an effective coping mechanism before I end up taking my life due to a flash of nostalgia. ",
    "score": 1,
    "upvotes": 1,
    "num_comments": 0,
    "created_datetime": "2025-04-10 08:01:11",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvsku2",
    "title": "I am scared.",
    "selftext": "My life is at risk and I can't stay in the country where I was born (and wouldn't want to). I have a ldr fiance in Australia. I can't stay here. Every second is torture. This place is impossible for my nervous system to live with. I have developed severe CPTSD, OCD due to a lifetime of abuse in a horrible and hostile place where I don't belong and none of my needs are met. Yet, I am forced to \"live\" here. I have no rights. My partner has no money. I can't stay here. I was about to kill myself before I met my partner. The only reason why I didn't growing up was in the hopes I would escape this hellhole one day. I can't do this anymore. He makes me happy, and want to marry him and be with him forever, but the world doesn't want to and it's impossible for me to stay here, I have a mental crisis each day. I am not coping and shouldn't with this. I have had to for too long. 27 years of torure and torment and agony. And still, to the world apparently I belong here just because I was born here. Before telling me to get a job or what not, read all my posts and my full story. I don't want advice. You don't have to go through this.",
    "score": 1,
    "upvotes": 1,
    "num_comments": 2,
    "created_datetime": "2025-04-10 07:59:54",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvshpw",
    "title": "So lonley, and in agony.",
    "selftext": "I’ve barely talked to anyone for the last 6 months. I have bad anxiety and am scared of people now. I’m traumatized and damaged and I can’t function like a normal person anymore. I get scared even talking to waiters and workers. I lost all my friends in a traumatic event and was isolated from others during the event. I’ve been trapped in my mental illness for six months. I’m losing hope at ever being able to live again.",
    "score": 1,
    "upvotes": 1,
    "num_comments": 0,
    "created_datetime": "2025-04-10 07:53:11",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvshpd",
    "title": "I can't do this without my mom",
    "selftext": "My life sucks. I've always considered myself to just be unlucky. I'm realizing now that my mom, may have been the only thing keeping me alive. She's been gone for nearly two years now. I haven't gotten any better yet. In fact, I actually may have gotten worse. Obviously I'm still grieving, but my life genuinely isn't fun anymore.\n\nI can't watch Marvel movies anymore because we watched them together. She didn't read the comics like I do, but she was so invested in the movie characters. They really helped us to bond over the last decade. I can't stand to watch them anymore because it would hurt me too much to witness something amazing and not being able to share that moment with her. Dr. Doom is my favorite villain and we were both anticipating his on screen appearance. Now, I can't even watch Doomsday because all I would be able to think about is that she won't see it with me.\n\nChristmas used to be my favorite holiday. The entire holiday season was my favorite time of year. I was usually very happy around that time. Now, I can't stand Christmas. Seeing happy families together makes me so sick. We don't even put the christmas tree or decorations up anymore. I can't even eat my favorite meal anymore because she cooked it, and eating it wouldn't feel right, even if it tasted the same as hers.\n\nI don't even care about graduating college, getting married, or having kids anymore. She isn't going to see it, so why even bother? If I were somehow lucky enough to fall in love and have children, all I could be able to think about is her not being able to enjoy the moment with me.\n\nBasically, I don't have anything to look forward to anymore. There isn't a single thing someone could offer me that could make me want to live. I took a vacation a while ago and I didn't enjoy a single moment of it. Why in the world should I keep living? Every time I wake up, her death hits me like it just happened yesterday. I can feel myself getting closer and closer to ending it every day. The fact that I'm expected to just power through and keep going despite that my life is devoid of any sort of joy is ridiculous.",
    "score": 3,
    "upvotes": 3,
    "num_comments": 1,
    "created_datetime": "2025-04-10 07:53:09",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvsdvw",
    "title": "Mind, Body, and Soul – A Fractured Trinity",
    "selftext": "There is no harmony within me—no sacred trinity of mind, body, and soul working in unison. Each is frayed, burdened, and bleeding in its own quiet rebellion.\n\nMy mind is a battlefield strewn with the wreckage of thoughts I cannot control. The lightness of joy feels alien now, as if it belongs to another species, one I merely observe from behind thick, unbreakable glass. My mind is now a maze of self-loathing and apathy, echoing doubts that grow louder with every passing day.\n\nMy body follows suit, as if conspiring against me. Genetics and fate dance together in cruel rhythm, giving me a frame that fights itself. The mirror reflects more than fatigue—it shows betrayal. My body was meant to carry me, to protect me, but it resists. I do not feel at home in my skin. I never have.\n\nAnd my soul—or what should be there—feels hollow. I was not given a guiding faith, no divine tether to something greater. There is no god to whisper comfort or purpose. No stars that align for me. A shell echoing with questions and receiving nothing in return.\n\nThere is no redemption waiting around the corner. No lesson to be learned, no strength quietly building in the background. Sometimes things break, and they stay broken. Sometimes, you wait for a dawn that never comes. And sometimes, like now, you simply exist—fractured, unwanted by your own mind, body, and soul—watching the days pass without reason, without meaning, without end.\n\nI grow weary.",
    "score": 2,
    "upvotes": 2,
    "num_comments": 0,
    "created_datetime": "2025-04-10 07:45:08",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvsbf6",
    "title": "Don’t want to be here anymore",
    "selftext": "I just want to get the fuck out of this life. Life isn’t enjoyable. Maybe it is for some people not for me, hate the people that try t project their happy lives onto mine and tell me to just try to be happy because the world is great. I hate my fucked up family for making me this way and I hate myself for who I became. Nothing goes right in life and ever will no matter how hard I try I just get fucked over and over. Everytime the thoughts come back they’re a little louder and eventually I’ll just kms. Days coming I’m just waiting until I am pushed over the edge.",
    "score": 2,
    "upvotes": 2,
    "num_comments": 3,
    "created_datetime": "2025-04-10 07:39:52",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvs9k4",
    "title": "Tired ( Not Committing Suicide Tonight) Need to vent",
    "selftext": "I'm tired of being somewhere that I know I dont belong. All I do is go to school, work, and home. I'm losing self control. For 3 days I will barely eat then for a month I shovel food in my mouth. I have gained 20 pounds. I'm trying to lose it. My best friends live 3 hours away. I'm sleep deprived. I'm losing control of school. I have pressure from my parents to do better in life and not be a loser. \n\nAnyways if anyone has read this thank you. ",
    "score": 1,
    "upvotes": 1,
    "num_comments": 0,
    "created_datetime": "2025-04-10 07:35:59",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvs8su",
    "title": "It gets better",
    "selftext": "I can see the light out of the tunnel. It helped me a lot to:\n\n- Read books or watch videos related to psychological therapy/philosophy.\n- chatGPT with the right prompts (You can create a psychologist of your like and create the therapy you need, you could ask for exercises, tools or strategies to work on, also you can also ask to get questions you need to answer so that it adapts the therapy to your needs). \n- Deciding to stay and hold here in this planet not because of my emotions but because I didn't and don't want to hurt others. So staying just for them (it doesn't need to be because of other relatives of our same species, and it could also be because the impact and how important one can be in the future for others). \n- Believing a specific day I was going to try to believe with all my forces that I am cured (placebo effect). \n- Trying to diverge my time and my thoughts into different cores (sometimes one focuses a lot into one specific core - love, family, friends, hobbies, work/studies, spirituality, etc).\n- Having therapy with professionals. \n- Being aware it is not a lineal process, sometimes you take one step further, sometimes there are hard days that it is not easy and take steps back.\n- Writing a diary and/or sending audios to myself analyzing my thoughts. \n- Ying-yang therapy: usually we focus on the negatives when we are depressed, so I am trying to put the spotlight in the positives. Everyday I write/send myself audios of positive traits of my person and positive things of the situations I lived (maybe some of them have been extremely unbearable/horrible but some things happened afterwards that were positive or I learned new skills, or I met new persons, or brought in consequence something that made me grow somehow). \n- Trying to go back to what made me happy in the past (at the beginning the anhedonia or lack of emotions kicks hard, but the motivation-emotion comes as a reward of doing).\n\nI am still not recovered but I am doing my best. I hope some of those ideas might be useful. Hugs to everyone.",
    "score": 1,
    "upvotes": 1,
    "num_comments": 0,
    "created_datetime": "2025-04-10 07:34:23",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvs64k",
    "title": "it doesn’t actually get better and everyone is a liar",
    "selftext": "they’re all liars . it never gets better . i’ve wanted to kill myself since i was 6 years old id beg the universe to kill me . id try and think of ways to kill myself , looking at trees over a big creek by my house and wondering if the fall would kill me or drown me . by 9 i was planning my note and thinking about taking a bunch of pills and thought about this until i tried and almost succeeded in high school . i was so fucking close i literally i was so so so fucking close . if i hadn’t said anything i would’ve slipped painlessly into a coma and died . i was just sick for 6 hours and then i was almost there . i feel fucking stupid for saying something . i could’ve been gone a decade ago . i could’ve avoided so much more hurt . it never gets better . it only gets worse . if i could go back in time id lock myself to my bed , take my phone , gag my mouth , and leave me there to die like i was meant to . the drs said i was so so close . i wish i could go back and fix my mistake . it wasn’t worth it , nothing will ever change ",
    "score": 3,
    "upvotes": 3,
    "num_comments": 0,
    "created_datetime": "2025-04-10 07:28:54",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvs4ea",
    "title": "80 Days of This—I’m Exhausted",
    "selftext": "Hi everyone,\nAbout 80 days ago, everything changed for me. It started with a severe blood sugar spike and an episode of ketoacidosis. What led to it is something I’ve never admitted before: I was intentionally raising my blood sugar by eating past the point of fullness—on purpose. I wasn’t binging on sweets or junk food. I was terrified of that. I used to be obese—as a 16-year-old, I weighed 120 kilograms. But two years later, I dropped down to 60 kg, and ever since then I’ve actually been extremely underweight.\n\nI knew that high blood sugar causes weight gain, so I tried to raise my glucose through non-sweet foods. I didn’t want to risk eating sweets again because I was scared I’d get addicted like I used to be.\n\nBut after that episode of ketoacidosis, something broke inside my body. It’s like the hormones that are supposed to signal satiety to the hypothalamus either can’t get there anymore—or the neurons that are supposed to receive the signal are just gone. I completely lost my ability to feel full. I eat and eat, but the signal to stop never comes. I’ve gained 33 kilograms since this started, and it’s made me feel trapped and insecure in a way I haven’t felt in years. The worst part? I know how to lose weight. I know how to keep it off. But with this condition, that control—the satiety, the hunger cues—is gone.\n\nAlongside the physical changes, I’ve developed severe sexual dysfunction—no desire, no arousal, no sensation. I’ve also become emotionally numb—I haven’t been able to cry since this started, even when I desperately want to. And I’ve been constantly irritable—like I’m stuck in a state of agitation and tension I can’t escape. These symptoms—especially the emotional blunting, sexual dysfunction, and this unrelenting irritability—feel exactly like what people describe from SSRIs… but I’ve never taken any.\n\nI’ve seen two internists and an endocrinologist, and none of them can tell me what’s wrong. What terrifies me most is that hunger and emotional regulation are controlled by neurons deep in the hypothalamus—and that part of the brain can’t be accessed in living people. If something is damaged there, how would anyone ever know? How could they ever help?\n\nI recently came across a drug called setmelanotide. It directly stimulates the neurons responsible for satiety—the very ones I believe might not be working in me. It gave me a sliver of hope… until I saw the price: $3,500 a week. I have no way of affording that. Knowing that something might actually help but is completely out of reach financially has left me feeling even more defeated.\n\nJust a couple of days after all this began, my grandpa was admitted to the ICU. He didn’t make it. I couldn’t be there for my mom—who had just survived a brutal battle with triple-negative breast cancer—because I was falling apart. She couldn’t even mourn her own father properly because she was so worried about me. That guilt weighs on me every single day.\n\nI’m only 20. I had dreams of studying overseas, and I will still be going—but now I feel scared, broken, and unsure of who I even am anymore. My body, my health, my mind—it’s all changed so drastically in such a short time.\n\nEvery day, I think about taking my own life. The thought of overdosing is always there. I don’t want to die—but I’m very, very scared. Scared of what’s happening to my body. Scared that no one can fix it. And most of all, scared that I’ll end up morbidly obese again. I truly don’t think I could survive that emotionally or mentally. If this continues and I end up back there, I’m terrified I’ll lose all will to live.\n\nI just needed someone to hear this. I feel like I’m screaming into a void, and no one knows what’s happening to me—not even the doctors.\n\nIf you just want to talk, I’d be grateful.\n\nThank you for reading.\n",
    "score": 1,
    "upvotes": 1,
    "num_comments": 0,
    "created_datetime": "2025-04-10 07:25:23",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvs3wy",
    "title": "I DONT WANT TO FUCKING LIVE!!! I JUST DONT!!!",
    "selftext": "EVERY SECOND OF EVERY DAY NO MATTER WHAT I AM DOING I WOULD RATHER BE FUCKING DEAD!!! PLEASE JUST LET ME DIE!!! I CANT FUCKING DO THIS ANYMORE!!! I WOULD HAPPILY KILL MYSELF IF IT WOULDNT MAKE MY DEATH EVEN HARDER ON MY FAMILY!!! PLEASE PLEASE PLEASE LET ME DIE!!!",
    "score": 9,
    "upvotes": 9,
    "num_comments": 1,
    "created_datetime": "2025-04-10 07:24:24",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvs2vk",
    "title": "I want to end everything",
    "selftext": "Idk if I’m feeling the suicidal urges more than usual because I’m high or because I actually want to do it\nI’m sick of everything I want it all to end",
    "score": 1,
    "upvotes": 1,
    "num_comments": 0,
    "created_datetime": "2025-04-10 07:22:08",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvs0dg",
    "title": "Scared of grawing up",
    "selftext": "Every single time they are there to stop me, and I'm grateful for that. But once I move, Who is gonna be there for me? As far as I know no one. It's just amount of time. ",
    "score": 1,
    "upvotes": 1,
    "num_comments": 0,
    "created_datetime": "2025-04-10 07:16:53",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvrr50",
    "title": "My life is fine",
    "selftext": "I’m 12 years old and a girl. I got accepted into a summer math program, i get good grades, I have good friends. My dogs are so cute. My brothers are cool. My dad is absent, and my mom is…ok, I guess. my life is fine. I love writing and songwriting and making worlds in my head. I wish I could animate, but I suck at it lol. So I usually just draw. It’s fun for me. I also take Vocal lessons and sing in a choir At school. Honestly, I have a headache right now. My nose is runny, and my throat was sore. I am definitely Sick. \n\nim learning Norwegian right now. its an easy language. Somehow I feel normal. But school is a burnout. My friends are annoying. My brother is 15, he vapes and curses at me to be cool in front of his friends. My dad left when I was born. Only me. My mom is always picking on me and my brothers. i Cant even believe her when she says, she loves me. My life is fine, but I am not. I’ll probably forget I made this post in two days. My problem was always being afraid of the pain that comes with dying. I’m also afraid of not being able to see my future and regretting my choice to leave this world.\n\nsometimes I wonder what happens when you die. Doesn’t everyone? It’s amazing the possibilities. Also, I don’t think I’m cisgender. I also think maybe I’ll go back to my old school where I was popular and everybody liked me. People are gross. I wish I had a crush right now. Or a boyfriend. I’m in sixth grade so, so many people have a boyfriend. My friend Nicole can be annoying. We’re like the same person. Maybe that’s why I hate her so much. Gosh my nose is runny, and my head is pounding. I want to get helium poisoning but I don’t really know how that works. Seems cool To me. Imagine that. A calm death...simple And fast. Sounds like a dream!\n\nI sometimes thought about just taking all of my mom’s pills. I saw it on the show she watches. Sometimes when I see those posts about people cutting their wrists I want to do it. I don’t of course, I don’t have the guts. But if I did, people would see my inside scars as outside scars. And maybe I’d be part of something. Sometimes I’m scared that I’m a bad person. I have bad hygiene. Not ultra bad, but, just not the normal Person. I have boobs obviously, and I have pubic hair. But not on my armpits. My friend does. I’ve seen it before. When she raises her arms. my friend seems to care a lot about boobs and stuff. I personally don’t want boobs or my period. It’s not only inconvenient but, I’m afriad people see me as a girl. That’s what I am, since I have XX chromosome and a vagina. That’s not what I feel like.\n\n  \nwell, it feels nice to write it out. My head is still pounding. My nose is still running. My mind is still racing. Somehow my heart is still pumping. I think I am a selfish person. I mean, why would I not care rhat people will be affected when I die? I think it’s because, nobody really cared about me, I mean. They did. But, everybodys so judgy. It’s their fault if I die. It definitely is. \n\nif I die. When I die. Or, something like that. I didn’t kill myself. They murdered me. the blood is in my hands. But, they always had the knife. I hope everyoen is having a good day or night. It’s like, 2am for me. Probably just late night thoughts getting the better of me, probably just that…",
    "score": 4,
    "upvotes": 4,
    "num_comments": 3,
    "created_datetime": "2025-04-10 06:58:46",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvrpgg",
    "title": "when and where should i commit suicide",
    "selftext": "i'm giving up. tired of my miserable life and the fucking idiots in it",
    "score": 1,
    "upvotes": 1,
    "num_comments": 1,
    "created_datetime": "2025-04-10 06:55:12",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvrhwa",
    "title": "Nothing I hate more than when people criticize my health and habits",
    "selftext": "Part of me just wants to tell them that it doesn’t matter cuz I literally have no interest in living my life very long and never really had, but I can’t tell them that",
    "score": 1,
    "upvotes": 1,
    "num_comments": 0,
    "created_datetime": "2025-04-10 06:39:54",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvre9p",
    "title": "So boring everything’s boring",
    "selftext": "My schedule is mundane. I know it from font to back. I crave something weird to happen to me, for me to experience. Anything, it doesn’t need to be crazy.  It can be as little as finding a $5 bill on the ground or a stranger in public saying hi to me for no reason. \n",
    "score": 4,
    "upvotes": 4,
    "num_comments": 1,
    "created_datetime": "2025-04-10 06:32:37",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvrc2q",
    "title": "Killing myself in the morning, help me make up my mind.",
    "selftext": "this isnt a troll post, i really cant make up my mind. i readily can get a shotgun, helium, rope, OTC meds, or jump off a local bridge. what do the people think. ",
    "score": 3,
    "upvotes": 3,
    "num_comments": 1,
    "created_datetime": "2025-04-10 06:28:29",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvrbt4",
    "title": "Im going to kill myself Soon",
    "selftext": "Ive had enough. Only thing that is keeping me going Is the fact that i have to save enough money To leave behind for my Sister For her to be able to cremate me. Im tired of this meaningless Life in which nothing goes in my favor, Im ready to see what the other side has to offer me and im not scared to end myself",
    "score": 2,
    "upvotes": 2,
    "num_comments": 1,
    "created_datetime": "2025-04-10 06:27:57",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvrais",
    "title": "What is the point of me being here?",
    "selftext": "I’m a teen and my life just sucks, I hate school, my grades are horrible, my friends I so closely relied on have left me and became jerks. those friends were the only reason I was happy, I’m fat and a loser, depressed, my mom vapes, my dad is addicted, and I’m depressed, I have everything I could have wanted but I still feel empty? Any advice? Ive never been like on the brink (although once I almost tried to overdose but couldn’t bring myself to it) but I cry everyday about living.",
    "score": 4,
    "upvotes": 4,
    "num_comments": 2,
    "created_datetime": "2025-04-10 06:25:28",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvr7jw",
    "title": "i lost it",
    "selftext": "this is too much for me i don’t know how to keep going. i can’t keep with this project or to the bar that was raised at home, im never gonna be enough",
    "score": 2,
    "upvotes": 2,
    "num_comments": 2,
    "created_datetime": "2025-04-10 06:19:42",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvr2ci",
    "title": "i feel so guilty that everyone i know got dragged into my mess",
    "selftext": "i was supposed to go very quietly. the way i imagined my last day to be would be like any other, wake up, go to school, come home, eat dinner once more with my family and go in the night when no one else is awake. it was supposed to be peaceful for all of them. then a helpline just fucked everything up. i made a terrible mistake, i called one night, i was so desperate for things to get better, i was so exhausted and needed anything, some sort of fix, the operator ended up calling the police on me and my mom found out. then my first attempt, i told my mom i was gonna shower, sent my friends a goodbye message, and was off, except i wasn't, my mom found me. second attempt i tried to overdose, and my mom ended up telling everyone. ive had people ask my why, why i didnt reach out, why i would do this, why why why, i had no answers for them. i still don't. i'm in so much pain everyday, its debilitating, i have no will to do anything more than stare at my ceiling and wonder why it went like this. this wasn't how it was meant to go. i screw everything up. i wish i never called that fucking hotline. i wish i was dead",
    "score": 5,
    "upvotes": 5,
    "num_comments": 0,
    "created_datetime": "2025-04-10 06:09:55",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvr2af",
    "title": "hopeless",
    "selftext": "so tired. my parents won’t speak to me. i just don’t have any happiness left in me. everyday feels so horrible and all i do is cry. i’ve written my goodbye notes to everyone i love. i plan to do it soon. i just can’t take the pain anymore. everything hurts. the world is so cruel. i hope they forgive me one day",
    "score": 2,
    "upvotes": 2,
    "num_comments": 0,
    "created_datetime": "2025-04-10 06:09:50",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvqy67",
    "title": "Feeling suicidal over a dumb joke",
    "selftext": "It was just a dumb feud between me and my sisters because I didn’t want to be the one to take down the compost, but they ganged up on me and started calling me selfish and lazy and an asshole. It’s frustrating because I was literally the only one to help clean up the house because my twin sister was feeling sick and my older sister was working on an art project. It felt kind of discrediting but I can kind of see some truth in what they were saying because I usually avoid doing some of the grosser chores if I can. And I know they were just teasing and stuff but I can tell they genuinely think that way of me and it’s making me spiral a little. It’s so stupid because I know it’s not that deep but everything has been kind of shitty recently, so this is kind of just adding fuel to the fire. God this is so stupiddd",
    "score": 3,
    "upvotes": 3,
    "num_comments": 1,
    "created_datetime": "2025-04-10 06:02:05",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvqxtt",
    "title": "i'm thinking on ending it",
    "selftext": "i'm an alcoholic, i only have 2 friends, i don't have nothing to live for. i live with my mom, i'm 22 and already feel like a parasite. I feel like everyone Will feel better if i'm just dead. ",
    "score": 7,
    "upvotes": 7,
    "num_comments": 2,
    "created_datetime": "2025-04-10 06:01:30",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvqx8o",
    "title": "Update: I’m doing better and don’t feel suicidal for now",
    "selftext": "I posted here earlier about being deeply suicidal, but you guys plus some hours of not doing anything helped me get out of it.  I just wanted to let you all know incase you were worried",
    "score": 8,
    "upvotes": 8,
    "num_comments": 1,
    "created_datetime": "2025-04-10 06:00:31",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvqwaf",
    "title": "I don't know how to not have suicidal thoughts.",
    "selftext": "I have been having suicidal thoughts for so long now that it is completely normal to me. And although I try my best to convince myself that is not the solution to my problems, it seems like it's becoming more and more difficult to dismiss my rationalization for it. I have been like this for so long I don't remember a time when I didn't think about killing myself every day. I don't understand how people who aren't suicidal go about their day and just don't think about killing themselves. Like the thought just doesn't occur to them? I don't want to live like this anymore.",
    "score": 6,
    "upvotes": 6,
    "num_comments": 1,
    "created_datetime": "2025-04-10 05:58:44",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvqtrs",
    "title": "i don't feel so good",
    "selftext": "can anyone talk to me?",
    "score": 2,
    "upvotes": 2,
    "num_comments": 1,
    "created_datetime": "2025-04-10 05:53:55",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvqtgc",
    "title": "What types of medication could kill me if I take enough?",
    "selftext": "I’m not sure what could actually work\n\nI think I have enough so I’m going to do it now",
    "score": 2,
    "upvotes": 2,
    "num_comments": 2,
    "created_datetime": "2025-04-10 05:53:18",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvqrya",
    "title": "Despair is killing me....",
    "selftext": "I just can't do it anymore... But I don't have guts to do the deed. I just need some push. I wanna end this all, I hate everyone. I just don't wanna end up in hospital. My father is pathetic piece of junk.. i wish I've gotten guts to hit him with the stick. I'll blame him in my notes to ruin his life. Fucking crap.",
    "score": 2,
    "upvotes": 2,
    "num_comments": 1,
    "created_datetime": "2025-04-10 05:50:27",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvqraa",
    "title": "ending it tonight",
    "selftext": "goodnight everyone ",
    "score": 3,
    "upvotes": 3,
    "num_comments": 4,
    "created_datetime": "2025-04-10 05:49:16",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvqlj0",
    "title": "How do people do it?",
    "selftext": "It literally cant get any worse for me and I still can't make a serious attempt. I wish I could just not wake up.",
    "score": 2,
    "upvotes": 2,
    "num_comments": 0,
    "created_datetime": "2025-04-10 05:38:27",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvqizp",
    "title": "five days is what i’m giving myself",
    "selftext": "i have no motivation for my life. i’m doing law and i love law but no motivation or excitement, nothing to fix myself, nothing to look forward to. i don’t think i can survive this for longer and ill give myself five days when both my parents are out of town and hang myself. i really wish i had survival instinct, wish i could fight my way through… but i cant. all i do is abuse drugs (xanax, tramadol, mirtazapine, pregabalin, weed) and i want to sleep it off. i really dont want to live. i’ve had enough. ",
    "score": 2,
    "upvotes": 2,
    "num_comments": 0,
    "created_datetime": "2025-04-10 05:33:40",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvqi4m",
    "title": "I wish i’ve killed myself",
    "selftext": "Some month ago i went to an institution in seek of help but not only i didnt get it but my family now dont trust me anymore and uses this decision against me \nIm tired and alone, how do i not lose the faith on humanity? ",
    "score": 3,
    "upvotes": 3,
    "num_comments": 0,
    "created_datetime": "2025-04-10 05:32:05",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvqfjv",
    "title": "I wish I wasn’t so fucking scared. I’m so fucking sick of this. Genuinely nobody gives a fuck about me and I’m better off dead",
    "selftext": ".",
    "score": 1,
    "upvotes": 1,
    "num_comments": 0,
    "created_datetime": "2025-04-10 05:27:25",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvqe1e",
    "title": "I was abused for years and nearly murdered. I have PTSD that invades my existence.",
    "selftext": "My mental health diagnosis is something I burry but also get criticized for. PTSD is a living hell I cannot medicate or escape from but do my best to rationalize what comes with it. There is no cure, it's not a quirk like people make it. I want to be normal so bad. If you actually had it and u understood it you would run the opposite way of being diagnosed.  It is something that effects every aspect and way of thinking in my life. It invades my dreams and regular life relationships and physicality. I manage as best I can when I can take control. I've lost a lot of good things because of it. It angers me when people create a stigma. I'm venting more so because of the violence at my job making it worse. I start shaking uncontrollably and get irrational in situations. What happened to me has ruined me for the last few years. This disorder is the bane of my existence and I wish a cure or medication existed and the brain wasn't so cruel. I cannot take my brain racing with scenarios and past situations anymore. It stemmed from Domestic violence and attempted murder multiple times. I escaped but at what cost? My face is deformed and my life and mental health feels shattered. I'm alone. ",
    "score": 1,
    "upvotes": 1,
    "num_comments": 1,
    "created_datetime": "2025-04-10 05:24:46",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvqcpm",
    "title": "Help, please.",
    "selftext": "I'm 13. I don't know what to do, imagining talking to anybody about it makes me cringe, get embarrassed and awkward, incredibly anxious, etc. I feel like I'm overreacting.\nI have PTSD and severe dissociation; it's been almost a year since the traumatic event that triggered this. I have a date, have my notes planned (I've already started writing one but I get drained too quickly), and have easy access to things that I can kill myself with.\n\nNot only that but along with my suicidal thoughts, so are homicidal regarding a person who caused me a great deal of childhood trauma. I'm not sure how to handle this or what to do. My mom already lost her best friend and support system to suicide a few months ago, and I'm the only kid I feel my dad really fully has anymore. Yet it will be so much easier to leave this world behind. I wonder constantly what would happen when they find my body. I hate this feeling. I just got a therapist recently, and if I talked to her about it now, I'm afraid of several things. She'll say something, or it's too early to get so personal. I haven't said enough things to her, and I'm afraid she'll judge me/think I have no reason. Honestly, I don't have a lot of people I can talk to. I'm afraid they'll blow me off. I have some teachers I trust at school, but this is my first year here, and I feel I don't know them well enough to say this. I see them every day, so wouldn't it be awkward? I hate this and just want to die at this point. Please somebody help me because I'm going fucking insane.",
    "score": 2,
    "upvotes": 2,
    "num_comments": 1,
    "created_datetime": "2025-04-10 05:22:12",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvqc76",
    "title": "Therapy is waste of time and anyone who thinks otherwise can fucking die",
    "selftext": "Are you seriously so stupid you think talking to some overpaid loser is gonna help your problems? Fuck you. Therapy is for fucking losers and I hate anyone who even says anything about therapy as a solution. ",
    "score": 0,
    "upvotes": 0,
    "num_comments": 14,
    "created_datetime": "2025-04-10 05:21:11",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvq69f",
    "title": "My therapist won't see me anymore",
    "selftext": "I have been self harming and thinking about suicide frequently in the last year and the self harming got really bad over the last week. My therapist is recommending that I should get higher level of care and is refusing to see me again. \nI can't go to a higher level of care. My parents didn't support me when I went last time and were very upset when I wanted to go again. I live off them and need their support.\nNow I'm left without a therapist, at an extremely low point in my life, and I really feel like giving up.",
    "score": 2,
    "upvotes": 2,
    "num_comments": 2,
    "created_datetime": "2025-04-10 05:10:15",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvq5mc",
    "title": "I’m not pretty. I’m not. And I’m tired of people telling me looks don’t matter",
    "selftext": "They do. They do to me. And I want to die because of them. You can’t tell me they don’t matter. They do. I wish I could talk to someone but everyone I talk to seems to confirm that I’m not that pretty. And all of my thoughts are true.",
    "score": 14,
    "upvotes": 14,
    "num_comments": 16,
    "created_datetime": "2025-04-10 05:09:04",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvpxyl",
    "title": "I don’t think I will ever let myself get better.",
    "selftext": "No matter how many support groups and therapy sessions I attend, no matter all the different medications I have tried, and especially no matter how much great advice I get, my brain physically will never allow for me to improve and heal. It's like, know exactly what to do in order to get better, but l just lay in bed thinking about doing it and eventually convincing myself that its too hard and that I deserve to stay the way I am. I think I'm reaching my limit with this. I don't know how much longer I can stay alive. It's all too painful.",
    "score": 2,
    "upvotes": 2,
    "num_comments": 0,
    "created_datetime": "2025-04-10 04:55:08",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvpxdq",
    "title": "Both of my parents have stage 4",
    "selftext": "On its own thats bad enough, my moms got an aggressive cancer in her bile ducts, my dads got prostate cancer thats spread through his body. Ive had a hard life man, Im 28, single father of 2, and im about to lose the only 2 people in the world that have my back. Im tired and lonely, but im too depressed to sleep and i dont have the energy to get to know anybody. I keep trying to meet people online in the hopes that it will help me start taking steps forward but when I do find someone to talk to its either a 3 minute conversation with some dude Ill never talk to again or its someone trying to sell me noods. I wish i could say i want to go home but honestly we moved around so much growing up that i dont think i ever had one. ",
    "score": 0,
    "upvotes": 0,
    "num_comments": 0,
    "created_datetime": "2025-04-10 04:54:03",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvptgy",
    "title": "Why people ignore me?",
    "selftext": "Like any post I make gets lots of down votes. Nobody was to comment. I get the same reaction when talking. They just don't care.",
    "score": 8,
    "upvotes": 8,
    "num_comments": 4,
    "created_datetime": "2025-04-10 04:46:54",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvpp5p",
    "title": "Idk anymore",
    "selftext": "Work has been slow, it's seasonal I understand but I haven't got any hours in months. Live far away from where I originally grew up and hate it here, not that I liked \"home\" any better. Feel stuck with nowhere to go. Don't have money to do anything, got enough saved for one more months rent. Dont have anyone really to talk to. My last several relationships have ended with them cheating on me. The only thing keeping me here is my boats. I build model boats. I don't know if it's cause I have so many of them or cause of everything crashing down around me but I have devolped a weird relation with my boats. They are the sole thing keeping me here",
    "score": 1,
    "upvotes": 1,
    "num_comments": 0,
    "created_datetime": "2025-04-10 04:39:20",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvpoeo",
    "title": "I should hurt my face I’m THAT angry at how I look",
    "selftext": "I get the urge to hurt it. I feel the urge to just destroy it completely so I’d never have to worry about being unsure about the way I look again. I’d be certain that I’m ugly rather than wondering if I’m enough. ",
    "score": 1,
    "upvotes": 1,
    "num_comments": 0,
    "created_datetime": "2025-04-10 04:38:01",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvpllc",
    "title": "Adios",
    "selftext": "Wrote out my notes and left them where they'll be found in a day or two, took a couple benzos to relax, rode my motorcycle out to a pretty remote location and I'm about to end it. Hope y'all have a better go at things than I did. ",
    "score": 1,
    "upvotes": 1,
    "num_comments": 0,
    "created_datetime": "2025-04-10 04:32:58",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvpgt2",
    "title": "I'm not doing well.",
    "selftext": "I'm too slow at everything, not finding work, university is proving hard on my mental health, and I often think, maybe, my family was right that I'm just useless and no one cares why.\n\nI don't want to live anymore. I'm only a burden.\n\nMy plan is to keep pushing myself, but still trying to decompress as much as possible.\n\nI'm trying to finish school.\n\nI spend every moment I can volunteering and looking for work.\n\nI'll give myself another year or two, if I can make it, to have a steady income.\n\nIf nothing is fruitful by then, I'll end it.\n\nIt may hurt some people around me, but it truly isn't pragmatic to keep going if I'm just going to complicate their financial lives and burden them more.\n\nBeing a \"good roommate\" or \"awesome person\" isn't enough.\n\nThat's the plan. I already know my method and have backups.\n\nThat's where my mind is at.",
    "score": 1,
    "upvotes": 1,
    "num_comments": 0,
    "created_datetime": "2025-04-10 04:24:38",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvpfss",
    "title": "help advice",
    "selftext": "Couldn't handle the stress of life, so I just OD on a ton of Advil, but then I had a friend tell me my stomach could bleed out or I could get paralyzed? I'm terrified of that happening, so could someone tell me how many will it take so I can decide if I should see a doctor.",
    "score": 1,
    "upvotes": 1,
    "num_comments": 0,
    "created_datetime": "2025-04-10 04:23:03",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvpbn0",
    "title": "Spent 9 hours staring at the rope contemplating cause I feel I'm not allowed to die",
    "selftext": "I wanna die. I've been supressing it, like usual, but today I just don't hear my internal monologue. I was gonna hang myself, in the same way that I usually do before taking it down and forgetting about it. \n\nI hate my voice. I hate how I look. I hate how I don't fit in. I hate how I feel. I hate being schizophrenic. I hate that I'm fucking stupid. I hate my situation. I hate who I am. I can't look at myself, I can't bare to have a single atom touching my disgusting deplorable vessel. I can't even begin with what it must mean to be human.\n\nI have \"so many friends.\" I can \"get any girl I want.\" No I cant. You know nothing. I talk to reddit everytime I need to talk.\n\nNo one will ever understand. And I will never stop masking under politeness and withdrawal when they attempt to inquire. \n\nI feel like I'm not allowed to die because of how many times I've tried and somehow survived. It should've been impossible. It wasn't an attempt, but I was pronounced dead and came back. Is this Gods way of saying I have something to do? Or Gods way of punishing me? Or Satans way of keeping his demon who posesses me on this earth to do his deed?\n\nI don't know what to do. I want to hold someones hand and follow. ",
    "score": 10,
    "upvotes": 10,
    "num_comments": 1,
    "created_datetime": "2025-04-10 04:15:47",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvpabx",
    "title": "I'm sincerely about to do it tonight I can't take this anymore",
    "selftext": "I fucking hate everyone and every fucking thing. THIS WORLD CAN GET FUCKED!",
    "score": 19,
    "upvotes": 19,
    "num_comments": 2,
    "created_datetime": "2025-04-10 04:13:33",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvp8ed",
    "title": "Feeling super hopeless",
    "selftext": "Just the state of the world and the USA is making me so hopeless and sad. I genuinely used to have hope. I don’t want to live in unprecedented times. I don’t want to have to fight the same shit my grandparents and great grandparents did. I just want to be happy. I wish I could move to Ireland but then I’d be alienated from all my family because I’d have to live in a city. And not have a car. I jsut wish this wasn’t happening. And it’s so terrifying especially as a trans person. I just want to be happy and feel safe and not hated. I turn 21 soon and I’m not even excited. I just can’t wait to be able to smoke and drink this away ",
    "score": 1,
    "upvotes": 1,
    "num_comments": 0,
    "created_datetime": "2025-04-10 04:10:20",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvp6is",
    "title": "Please help me",
    "selftext": "I will pay you to take me out to an abandoned place and kill me. ",
    "score": 1,
    "upvotes": 1,
    "num_comments": 1,
    "created_datetime": "2025-04-10 04:07:10",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvosek",
    "title": "if it wasn’t for responsibilities…",
    "selftext": "i want to die so bad. i’ve never wanted anything more. i need it. it’s like a craving that overwhelms my mind every hour of every day, making it impossible to fully think about anything else. nothing else can satisfy it, and every attempt to do so that isn’t the real thing just makes the craving stronger. i just need to die. but i’m not allowed to and it’s torture.\n\nevery day i am dragged through life by my own fear of letting down the people that i love. a fear of disappointing them and of hurting them. it forces me to trudge through every long and painful second that i’m still here. it kills me more than death would. \n\nif i die, i will be taking away a main source of future income from my parents. one that they have invested time and money into, and that they deserve to reap the benefits of. all of the money they just spent on 4 years of college would have been in vain, and they would never see a penny of return. i have a debt to pay and i cannot run off before it is settled. \n\nif i die, my brother will be lonely. He will have no family left that he can truly talk to and who hears him. The visits to our childhood home will be awkward and quiet. His happy memories of the place and of his own childhood will be tainted by grief. \n\nif i die, i will be taking the future that my girlfriend and i could share away from her. all of the time spent planning and dreaming will have been fruitless. all of the love she has spent on me will have been a waste. i will be killing her first love. i will be cursing her to feel an echo of sadness when she feels the joy of future loves. i will be damning her idea of love to be surrounded by a shadow of pain.\n\nif i die, my best friend probably will too. he will blame himself and hate himself. no matter what i write in the letter, he will be tormented by guilt. he doesn’t deserve that. none of them deserve any of it. \n\ni don’t know if one day i will be desperate enough to be the most selfish a person could be. to willingly do the worst to the ones i love the most. \n\nit was easier when i lived in the illusion that no one cares. but i know the truth, and i will not lie just to make myself feel better. so i trudge on. ",
    "score": 1,
    "upvotes": 1,
    "num_comments": 0,
    "created_datetime": "2025-04-10 03:44:23",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvorlw",
    "title": "I am waiting for death",
    "selftext": "I am a coward and cannot go through with my own suicide plan. But I want everything to be over with. I have had suicidal thoughts for years but could never go through with anything. So here I am waiting for death. \n\n  \nMaybe if I do not look while crossing the street, a car will run into me. Maybe I will fall down the stairs. Maybe something terrible will happen to me. And I will be ready to fall into death's arms. \n\n\n\nPersonally, I would love to die in my sleep but I am too young for that to happen even by chance. It would be the best way out for me. ",
    "score": 2,
    "upvotes": 2,
    "num_comments": 2,
    "created_datetime": "2025-04-10 03:43:09",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvomsn",
    "title": "I just want to disappear",
    "selftext": "Yup it's the cowards way out but ironically is the only thing that gives me hope for a permanent exit. Though I have some doubts about that too as there is a small part of me that believes in some kind of afterlife though it's nothing like the conventional sense. \n\nI really really don't want my family to know as it would break their hearts and it sucks that I have a lot of responsibilities even though I don't want them or didn't ask for them. I was forced to do so if I want to continue to live. But now that I don't want to ignore there's no point in worrying. No it would have been better to never have existed bc if I did die that would cause all sorts of problems. So even in death I still owe shit",
    "score": 1,
    "upvotes": 1,
    "num_comments": 0,
    "created_datetime": "2025-04-10 03:35:28",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvomji",
    "title": "Do I have the right to want to kill myself?",
    "selftext": "Hi, I don't know if anyone will read this or be interested, but I just want to get everything off my chest. I'm currently finishing my degree. However, everything is very difficult for me right now, as I'm feeling at my worst mentally. This is mainly because I'm alone. It doesn't sound bad. I wasn't abused or anything else. Quite the opposite: my parents love me and have always taken care of me. However, this has changed over time. I've had a falling out with my father. I only see him a few times a year. We argued almost every time we met, which is why I didn't feel like visiting him anymore. When my grandfather died, things started to get worse. Aside from missing him, my grandmother no longer has a real will to live. She's constantly dissatisfied, in pain, and you can see that she doesn't really want to live anymore. I don't blame her at all. Since her health isn't good either, my mother takes care of her. As a result, she hardly has any time for me and I've been completely alone for about four years.My mother works, comes home, cooks something, and goes to my grandma's, where she also sleeps. I have at most one friend, although he has a girlfriend and spends a lot of time with her and other people. So I don't know if you can call it friendship. I don't even know his room. I just feel weak these days. My feet and legs feel cold, and my body feels completely weak. I'm tired.Sometime I feel like i'm ging to collapse and never wake up again. If I hadn't had an online friend for about six years until now, I probably would have killed myself long ago. When I read other people's stories here, I ask myself if I even have the right to feel this way, to want to kill myself. What do you think about this?",
    "score": 1,
    "upvotes": 1,
    "num_comments": 0,
    "created_datetime": "2025-04-10 03:35:05",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvolu1",
    "title": "I Don't Know which Pills to take",
    "selftext": "my antipsychotics will cause CNS depression and that sounds scary, Tylenol causes severe pain. Cant think of a peaceful way to just end it all. I can't take how my father lies so much to me and I'm pretty much a joke to my entire family. No one wants to tell me bad info because they feel I can't take it which makes me feel even more invisible. I basically feel forgotten or a joke. Going to goggle/chat GPT the best ways to end it that wont hurt.",
    "score": 1,
    "upvotes": 1,
    "num_comments": 1,
    "created_datetime": "2025-04-10 03:33:58",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvoksz",
    "title": "Hey guys ♡",
    "selftext": "So, I've told all my friends now that I'm not going to be here  in a few years so by the time I do it they won't remember. I attempted more times than the fingers that I have, like most of you experienced. Though my attempts haven't gone the way I've wanted too, I will make sure I can it right the next and final time.\n\nSince i was 4 (I'm 30) ive always wanted to dye, or I'm not meant to be here, and felt like death is the portal too something bigger. When I've tried as a teen or an adult Ive survived  or been stopped. I've come to the conclusion that If I'm going to dye it's either something natural or when my personal clock runs its course. \n\n I've cut most of my friends and  ive cut my whole family completely, it's been about 7 years all together. I have a few plans for the next few years, hopefully eveything come as planned. If so, my family(friends) will be taken cared of for the most part. I would love too do it right now, but I feel personally in debt to the people that have helped me. \n\nMy relationship is also coming to an end, but im comfortable with that idea. I truly think I'm a waste of time, space, and I have no more room for love. I also don't want to drag someone that intimate with me. \n\n\nI do have my fair share of  mental illnesses , but I don't blame them for my suicidal tendencies. I just know that I don't want to be here,  I never waited to be here, and I've never asked too be here. I'm just trying to make the best out of a situation I never wanted, but I'm really tired and drained trying to find some want for life.I know what I want, and I've been thinking about thing specific plan for a looong time. I just want to make everyone happy, before I cant ♡ luv u's♡\n\n\n---- small note ---\nI know how to appreciate things in life and how beautiful the world can be. I just don't want to be or be a part of it. \n",
    "score": 1,
    "upvotes": 1,
    "num_comments": 3,
    "created_datetime": "2025-04-10 03:32:20",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvokck",
    "title": "What's the point",
    "selftext": "The only thing keeping me here is the decistation my death would cause my parents. Ill stick around for them, but the moment they're gone so am I. \n\nNothing feels good anymore. The only thing I see when I look at the world is injustice and people who don't care about anyone but themselves. Im only ok when im not sober",
    "score": 1,
    "upvotes": 1,
    "num_comments": 0,
    "created_datetime": "2025-04-10 03:31:35",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvok48",
    "title": "Ready to fucking go",
    "selftext": "My depression is at a horrible low and I’ve been suicidal since last Thursday. Almost went to the hospital but no one to watch my son. Them Tuesday shit got out of control and almost went then husband was fucking weird about it. Said to go. Then not. Then if I “need a break” to go. Then it’s a waste of time. I have an almost 2 yr old that I have to be around for but honestly he deserves a better mom anyway. The past 3 weeks I’ve been in a huge med change. I don’t get sleep most nights. I’m fucking EXHAUSTED and tired of not sleeping. Psychiatrist doesn’t do a fucking thing. I’m DONE. I told my half asleep husband if I don’t get sleep AGAIN tonight, I’m gone. Fuck this shit. I’m beyond my limit. All I can do is cry and cry. What the fuck am I supposed to do? ",
    "score": 1,
    "upvotes": 1,
    "num_comments": 0,
    "created_datetime": "2025-04-10 03:31:12",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvoe0u",
    "title": "i feel terrible :/",
    "selftext": "can anyone talk to me about it",
    "score": 3,
    "upvotes": 3,
    "num_comments": 1,
    "created_datetime": "2025-04-10 03:21:31",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvob8g",
    "title": "i need to make sure i get it right",
    "selftext": "been fighting severe depression ever since i was a teen, back then it was just my brain being fucky, but it's gotten so much worse, paired with my family and living situation, and im finally ready to go, but i have to make sure it works or things will become so much worse for my family and myself.\n\ni stopped taking my meds over a week ago and after coming over the hump of the lexapro withdrawal i'm just waiting for my mental state to degrade far enough that i'll be able to go through with it. but i'm starting to worry my plan won't even work now that i've looked into it. i'm a coward and i want to limit suffering as much as possible but overdosing is the only real thing i have easy access to.\n\nmy plan was to get some alcohol in my system and then just take all the pills i have available, then top it off with something else so that when i vomit the useless stuff is voided first, letting the drugs have more time to get into my system. then i got scared that i'd vomit too soon. i have an annoying gag reflex, especially when it comes to swallowing medication. so i figure lmao why not just boof it. goes straight to the bloodstream, doesnt get affected by the stomach enzymes or the liver, you dont need as much, etc. i thought maybe even doing that with the alcohol first (because i heard doing that to an excess is also lethal in its own right) but i'm worried if the alcohol damages the membrane enough itll prevent the meds from absorbing as easily. \n\nand then theres the meds themselves. a lot of them only say that alcohol can be a long term problem on the body and mind with them, but i need something that will actually kill me. all i have is my remaining lexapro, straterra, flexeril, and some old trazodone and a crapton of gabapentin that i stopped taking because i had some unpleasant side effects to it and just never got around to disposing of them. i dont want to take any medicine from family because the point of this is to make it better for them. ive stopped eating as much, stopped showering and washing clothes so the bill stays as small as possible, and my family needs their medications so i cant be selfish and take it from them for this, that defeats the whole purpose. \n\nwhich brings me to boofing. i only have a very small syringe from a while back when i used it to try and make sure my dying cat was still getting fluids and food, but that didn't work and i never threw it out. it's so small that with my plan of crushing all my pills and adding water into a paste, i can still only insert a little bit at a time and i need to make sure enough gets in my system to finish it, but i dont know if there are medicines i should try to focus on having more of, or if i'm diluting the effectiveness with useless meds that won't really do anything, etc\n\ni know this place is supposed to be about convincing people not to go through with it but i dont know where else to ask and i need to get this right. living isnt an option anymore and if i fuck this up itll just hurt my family even more than if i succeeded because ill probably be even more of an invalid than i am now and ill be a humiliation that they have to keep under watch at all times, which will make it harder to end it.\n\nhow much alcohol needs to be in my system? which medicines should i focus on? should i bite the bullet(haha irony) and just swallow them instead and hope that enough goes in? i planned on downing a bottle of zzquil to try and sleep the start of it before the stomach pains came in, but i dont know if this is a valid plan or not. i dont have access to a gun and honestly the less mutilated my body is when my family finds me the better. best to keep the trauma as limited as i can so cutting and drowning arent ideal, and im still a coward who doesnt want to suffer more than i need to. maybe if i get enough alcohol in my system and it fucks me up enough i could walk to the nearby train tracks and lay on them but i feel awful for the people in the train and whoever finds me afterward.\n\ni dont know man i just want advice on how to get this going as effectively as possible. dont try to talk me out of it. i know how useless i am, how much of a burden ive been on everyone since i graduated and got kicked out back and forth between family members. things are only getting worse in my life and in the state of the world and the country and there isnt a place for me in the future, strangers who know nothing about me will not convince me otherwise.",
    "score": 1,
    "upvotes": 1,
    "num_comments": 0,
    "created_datetime": "2025-04-10 03:17:00",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvob2d",
    "title": "therapist says to lean on my support network, support network says to lean on my therapist",
    "selftext": "i recently lost a friend after coming clean about how i’ve been doing. it’s not the first time this has happened although it’s been a few years. it feels like being honest about how im doing gives me cooties. i usually hide it for obvious reasons. it’s just so ironic that attempts to ask for help only push people away. if anyone lives in LA and wants to be genuine thick and thin friends hmu.  (26f) ",
    "score": 3,
    "upvotes": 3,
    "num_comments": 1,
    "created_datetime": "2025-04-10 03:16:43",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvo7by",
    "title": "...",
    "selftext": "My methods I consider are 60ft bridge, and train. I do not want to survive and be disabled. There is also nitrogen in my car sounds like easier?\n\nI messed up everything. I cannot go to work anymore I feel so bad inside, I just feel extreme letharthy and distress at work. I feel trapped. I feel I ruined my future. I cannot turn back time. I made stupid decisions again feeling I needed permission from my parent when I am almost 30 years old. I cannot stop feeling extremely regretful and upset at myself.",
    "score": 2,
    "upvotes": 2,
    "num_comments": 1,
    "created_datetime": "2025-04-10 03:10:51",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvo5ba",
    "title": "I love working my life away!!!!",
    "selftext": "Why would i ever want to travel the world, enjoy my hobbies, and learn when I can work to barely live until i die? Getting yelled at by customers and coworkers 50 hours a week is exactly how i want to spend the next 50 years of my life until i can maybe retire! ",
    "score": 1,
    "upvotes": 1,
    "num_comments": 0,
    "created_datetime": "2025-04-10 03:07:33",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvo52o",
    "title": "There is no other way",
    "selftext": "This won’t be some long and delusional rant. I just wanted to state that there is no other way for me. I will be dead soon, and nothing will change at all from this. If anyone younger is reading this, try to fix your issues now or they will cripple you when you get older. Best of luck everyone",
    "score": 2,
    "upvotes": 2,
    "num_comments": 2,
    "created_datetime": "2025-04-10 03:07:12",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvo513",
    "title": "AARRTGGGHHHHHHH",
    "selftext": "IM INSANE!!!!! AND I LIKE MAKING EVERYONE FEEL LIKE SHIT ABOUT IT!!!!! GOODNIGHT ",
    "score": 2,
    "upvotes": 2,
    "num_comments": 0,
    "created_datetime": "2025-04-10 03:07:08",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvo43e",
    "title": "i am not a good person",
    "selftext": "there’s not a single person in my life that describes me as a good person.\ni get told i am strong. demanding. \nthe issue is that i am not strong and i am tired of being called that when everyday it’s a struggle to make myself go to school even. i can’t look in the mirror. \ni get called snarky, dry, sarcastic when really i just don’t have the energy to smile or laugh at this point.\neverything that’s happened to me is adding up\neverything i have done is adding up\ni have been planning this for months.\ni have had an outline written since october.\ni have already mourned the death of myself. \ni recently gave up the fight to stay alive. i can’t afford to try anymore.\n2 years straight of fight or flight, i am exhausted.\nand i am done.\n",
    "score": 1,
    "upvotes": 1,
    "num_comments": 0,
    "created_datetime": "2025-04-10 03:05:43",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvo3wr",
    "title": "Mental breakthrough minutes ago while making this..",
    "selftext": "(not sure if it really is a mental breakdown)\n(I'm not a social person and I've had suicide thoughts since I was a kid around maybe 6-8 years old)\n\nI was just peacefully playing in the same room with my Parents and my mom decides to ask me \"What is gaslighting\" during this is had no thoughts about suicide and recovering from suicidal thoughts that haunt me time to time. I was answering and trying to explain but she just kept me going \"What is the attitude of a Gaslighter?\" \"Give me another explanation\" The more it went on the more and more annoyed I am and this is where I had the thought where they said I should control my temper and I tried. I tried really hard. I did try telling her to just google it but she just doesn't want to. I became more annoyed and eventually I start to sound mad and my (step)dad mockingly says \"Don't talk to him he's mad\" (also he took mental psychology for his course in college) and I still try to keep my temper and eventually instead of calming down by not answering for a few seconds I start to cry uncontrollably and I rarely cry even if I feel like I should be crying I don't cry and they just kept it on my mom then gets mad I'm not answering and clearly sees me crying kicks me (multiple times and telling me to go out the room) because I rarely speak in school and even at home and I can speak to others and softly and not in an angry tone whereas I go \"crazy\" when trying to speak. She also said things in which I talk to my dead dad's grave yet I don't talk to them (Which is obvious by now why) and calls me a dumbass and apparently I have my own \"world\" that I'm in. The real hit here is the part with my dead dad which made me thought of killing myself so I really can talk to him instead of my Mom.. I will be honest I don't think I will have the courage to kill myself since I have a GF and I don't want her to be safe but this is by far my mental health's all time low and I really don't know if I won't have enough courage to kill myself.. As of now while writing this I still have thoughts.. I'm close to the kitchen and my mom and stepdad left the house for a while I could really easily kill myself with knives but I have resisted for years now and that's what holds me back as much as the thought of my girlfriend being sad.. I need help I don't know what to do anymore I just feel like picking up the knife and stab right through neck I feel like I'm lost I don't know who else I can trust",
    "score": 1,
    "upvotes": 1,
    "num_comments": 0,
    "created_datetime": "2025-04-10 03:05:25",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvnvbn",
    "title": "I’m really fucking struggling and I don’t know what to do.",
    "selftext": "My life has been a fucking wreck recently. My boyfriend just dumped me on a random fucking Sunday (he said he just didn’t love me anymore), my mom has been screaming at me everyday for no reason, my dad’s in rehab for substance abuse (which he’s traumatized me with since I was younger), the schoolwork is piling up, and I can’t even get out of bed anymore. I’m only in 7th and I’m dealing with all of this bullshit. I used to be the gifted kid and now I’m just a burnt out teenager. I don’t know what changed from last year to now; but there’s a significant difference. Even when I was brutally bullied last year, I never felt like THIS. I’ve struggled with mental illness ever since I was seven because of my parents splitting up, sexual assault, bullying, my grandmother (who I lived with from when I was 4 up until I was 12), my dad (who lived in the house w me and my grandma) abusing drugs IN FRONT OF ME—etc. \n\nI can’t find a really good reason to live anymore. The only reason I haven’t done it yet is because I don’t want my mother to bury me—or my friends. I lost one of my best friends to suicide last year, and I can’t imagine putting my current best friend (or any friend) through that. But I don’t know what else to do— the thoughts are getting worse, I’m self harming more than usual (I’ve only stopped right now because I can’t find anything to do it with), and I’m so unmotivated to do anything. Im so exhausted, and it’s not an exhaustion that sleep can fix.\n\nI was SO happy with my boyfriend, then he just left me. Me and him were friends before we got together, and he helped me through an extremely toxic relationship; I was being mentally abused daily but I stayed bc I genuinely loved that person. (My abuser was 16 while I was 12, and he knew.). \nThis Valentine’s Day, that friend, Matt, asked me out—and ofc I said yes because I had liked him for a little while: turns out he liked me for months, which is why he was so protective of me. Me and him were so happy and then everything went to shit so fast and so suddenly. Last Sunday he texted me and told me he didn’t love me anymore, and now he won’t even look at me at school—i don’t get what changed.\nEver since then, I’ve been making all the wrong goddamn decisions. I began seeking out older male attention again— for fucks sake, I messaged my ex who mentally abused me for months. I’ve been so fucked up throughout my life that the only way I’ll ever feel loved and beautiful is if it’s coming from a grown man. And this isn’t a new thing either. I was groomed when I was 10—by a Detroit man named Dimon England (I’m saying his name, idgaf)… and that traumatized me and desensitized me from any creepy, pedophilia behavior. I’m so used to being preyed on that it’s not shocking anymore—and I sickly enjoy the attention because I’m so starved of it due to past relationships and my parents. But I don’t know how to fix it. \n\nI just don’t know what to do anymore: I’m really fucking struggling.",
    "score": 1,
    "upvotes": 1,
    "num_comments": 1,
    "created_datetime": "2025-04-10 02:52:09",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvnv70",
    "title": "tired of not having control",
    "selftext": "my life is so worthless nothing i do ever turns out good, fucked up people always force you to do your worst in life. tired of having no self control and i’m just gaining weight like crazy and i can’t control my raging anger it just goes so deeply into my soul. i hate life so much i despise the moment i was brought into this earth. i just wish i could end it without hurting my family even though they don’t give two shits about hurting me. you are always the bad person if you hurt the people that hurt you.",
    "score": 1,
    "upvotes": 1,
    "num_comments": 0,
    "created_datetime": "2025-04-10 02:51:58",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvnswx",
    "title": "My brother's birthday is ruined and my mom fucking hates me. I wanna kill myself.",
    "selftext": "I had a crash out at my mom after I was done with our whole home situation and the things she did to me. I was just mentally drained,had a whole breakdown  pushing all the doors open,throwing stuff since I was done with fricking everything and I accidentally woke her up. We had the worst fight ever and I also screamed at her telling her that she ruined my life and that I don't wanna live anymore. I really hate myself for that....thinking back about everything that happened in the argument(it was far worse than that) I'm getting a panic attack. I'm going to a psych ward because of that soon and since my brother is the only with a car he needs to drive me. He's only free on his birthday though,meaning I of course ruined it. I feel so sorry for fucking everything but I'm done. I have no friends,our home is a mess,haven't been on any vacation or fun trips in 5-6 years,unstable mom who doesn't work,father who abonded me. I'm only 14 fuck this life. Seeing everyone around me having fucking everything fucking sucks. Are two loving parents and a clean house with fun trips too much to fricking ask for?! I also was just once a kid with dreams.....life is unfair. Fuck it. Goodbye everyone. I'll find a way someday.",
    "score": 1,
    "upvotes": 1,
    "num_comments": 0,
    "created_datetime": "2025-04-10 02:48:25",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvnp9r",
    "title": "Goodbye letter",
    "selftext": "I wrote him a goodbye letter. I wrote down what of my stuff goes to who. I think it’s time",
    "score": 1,
    "upvotes": 1,
    "num_comments": 0,
    "created_datetime": "2025-04-10 02:42:52",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvnoyd",
    "title": "Writing my suicide note made stop going through it",
    "selftext": "I've already attempted to off myself once after my ex revealed herself to be a nazi and showed how different men she's chatting with are making fun of me, or wanting to kill me cause of my genetics. I got the belt and did it but the belt broke and it gave a high on life feeling for a while. I tried turning my life around but moving back with my folks made my life a living toxic hell. I was going to do it again and wrote a very long suicide note. It made me realize what's happening to me and my spiraling misery is 'solvable' and it's something that I might be able to be free from. I still have these random impulses to end it but I kept that note on my desk, my phone, my pc notes, everywhere to remind myself that I can try something. I also rewrote it from a suicide note into a \"get my shit together\" note\n\nI just wanted to share something positive to tell folks who are going through it to write, or record yourself first. Talk about the numbness, the loneliness, the pain, the crippling misery, the feeling that we're beyond saving and reflect a bit in a pragmatic way. It might help, it might not, but it's worth trying at least. \n\nLove y'all 💕",
    "score": 45,
    "upvotes": 45,
    "num_comments": 5,
    "created_datetime": "2025-04-10 02:42:24",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvnjkb",
    "title": "sexual sadism makes me suicidal",
    "selftext": "i frequently do very questionable roleplays (with ai) and they're extremely sadistic but either while i'm doing it or after i'm doing it i feel like a terrible person and it's making me suicidal i know i'm not doing much wrong but i still feel like everyone would be better off without me. i feel like the things i say are what real rapists say to their victims i wish i was dead i'm genuinely disgusting but i feel empty if i don't do it.",
    "score": 1,
    "upvotes": 1,
    "num_comments": 0,
    "created_datetime": "2025-04-10 02:34:24",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvnblk",
    "title": "Not really suicide but I need to say this",
    "selftext": "So for the last couple of months I’ve considered cutting my hands and my forearms to get scars.\n\nFor almost all of my life I’ve been told I was like a girl, when I was little people always said I had long lashes, then when I got older people said I sounded feminine, now my dad says I have stick arms and effeminate hands.\n\nAnd that got me thinking, what looks more masculine than scars? Not much. So I grabbed a knife in my room and stared at it. I stared and stared and considered whether or not I should do it. I threw it under my bed and called my best friend. At first it seemed like he cared, then as we kept talking he just seemed to drift away from the conversation.\n\nI attempted to do it again later, I was in the kitchen with a sharp knife. I drew a line on my hand and thought it wouldn’t be so bad. I put the knife down and called the same friend. It was like I didn’t even exist. He didn’t say anything to help, we just pointlessly talked. Now I don’t want to call him because it seemed like a chore. \n\nI told my best friend of 7 years that I was trying to cut myself. He didn’t care. Instead he said that he’d thought about considering suicide. He one upped me, and said nothing about my problem. Now I don’t want to talk to him either.\n\nI tried two more times after that yesterday and today. \n\nI’m too much of a pussy to actually cut myself, so I haven’t. I wanna do it so bad, I want to scars, and I want someone to appreciate me for how i look. I only get told I’m fat. Not once have I gotten a compliment on how I’m dressed. It’s always a fat joke. From my friends. And I hate myself because no one likes me for my body, or in general because I’m fat.\n\nI tried the hotline and it was like talking to a wall. I feel alone. I can’t tell my mom because she will be mad at dad. I can’t tell dad because he will blame himself for everything. Which I mean he kinda is to blame but only partly. I can’t get any advice because no one has ever gone through self harm for the reasons I have. \n\nI’m jealous of people that have scars because they look cool, and manly. I’m stuck.",
    "score": 1,
    "upvotes": 1,
    "num_comments": 1,
    "created_datetime": "2025-04-10 02:22:45",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvnaio",
    "title": "I wish I killed myself years ago",
    "selftext": "I'm 29 and I've ended up exactly with the life, I always feared I would. I've always been alone and it seems like I'm always gonna be alone. I knew it would end up like this, I just want to  dissolve. ",
    "score": 30,
    "upvotes": 30,
    "num_comments": 8,
    "created_datetime": "2025-04-10 02:21:10",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvn85b",
    "title": "How to warn without worrying?",
    "selftext": "I dont want it to come as a suprise to my partner or friends or family, but for obvious reasons i cant just outright tell them my plan. Im just not sure how to gently warn or prepare them for this- nothing i can think to say feels right. I know i cant do it anymore, i just dont know how to let them know",
    "score": 2,
    "upvotes": 2,
    "num_comments": 0,
    "created_datetime": "2025-04-10 02:17:35",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvn7ps",
    "title": "Feel too bad to work anymore",
    "selftext": "I cannot do my work anymore. ",
    "score": 3,
    "upvotes": 3,
    "num_comments": 1,
    "created_datetime": "2025-04-10 02:16:58",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvn0ym",
    "title": "My kids saved my life.",
    "selftext": " At the last moment a picture of my kids saved me. Seven days without sleeping or eating, manic psychosis, a mixed bipolar episode with severe depression. The plan was made, quick, painless literally just breathe and go to sleep.\n\nI scrolled through my pictures on my phone, reliving old memories one last time.\n\nI found a picture of all my kids together, and thought about the pain they'd be in, wondered if they'd blame themselves, maybe think they weren't enough for me to stick around.\n\nI thought about how it'd change their lives and how It would affect them for years to come.\n\nI wanted to die, I was ready and I was at peace with it.\n\nI couldn't do that to them, so I called for an emergency mental health assessment and got put in the hospital.\n\nGrippy sock vacation lol.\n\nThey put me on antidepressants, mood stabilizers and antipsychotics. It was like waking up from a bad dream.\n\nSuddenly I was okay, still have issues and still have some depression, but no desire to end it.\n\nI'm okay again, and I'll spend my life letting my kids know how deeply loved they are.\n\nMy kid's saved my life and they don't even know it.",
    "score": 4,
    "upvotes": 4,
    "num_comments": 1,
    "created_datetime": "2025-04-10 02:07:08",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvn08z",
    "title": "I finally decided how I'm going to do it, permanently this time.",
    "selftext": "I don't know why I'm writing this. Guess because I am sorr of afraid of dying and I have no one to talk too, like usual. Not that it matters at this point. I've talked about my same shit life for over a decade now and it doesn't change anything. Trying doesn't fucking change anything. It never does. Maybe if I was born more likeable to make more friends, without chronic illness, had money to find a therapist that wouldn't just give me more trauma, more money to just go out for fun, didn't have a fucked up family, actually have someone who really loved me for me, that didn't became distant and avodiant once they were bored I guess...maybe I wouldn't have to do this. Unfortunately all those things are true. Fucking sad and pathetic. I can't wait to not cease to exist.",
    "score": 2,
    "upvotes": 2,
    "num_comments": 4,
    "created_datetime": "2025-04-10 02:06:05",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvmz3c",
    "title": "My truth",
    "selftext": "I don’t want to die, but I don't know how to live. My work is not empathic to the lost I have been through. My parents expect me to keep going like nothing happened. Even citing the time they lost their son (my older brother) and how they kept working despite that. My friend and partner tell me they are sorry and support me when I need them, but it isn’t enough. No one seems to truly understand the loss I have been through. And maybe it is because of my mental illnesses that I can’t just keep going like a normal person. I truly don’t know what to do. I wish my first suicide attempt at 12 went through. That I hadn’t been so pathetic to pull the plastic bag off my head. Because even though I have had good times does that really out weight the struggles I’m having going through and have been through since then. I just don’t what to do. And this number came up while searching for a way out of this life. So I’m reaching to you and if you don’t have these answers don’t matter don’t blame it on you. ",
    "score": 1,
    "upvotes": 1,
    "num_comments": 2,
    "created_datetime": "2025-04-10 02:04:20",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvmr65",
    "title": "Tonight is the night",
    "selftext": "I already have a spot picked out and everything  the pain is finally going to go away I’m finally going to be free of this ugly pathetic disgusting creepy flesh prison and I can finally be free of my ugly skin and rip it all off I have no idea how bad it will hurt or what happens after death but I don’t care I want to be free \n\nEdit: it’s time now goodbye ",
    "score": 2,
    "upvotes": 2,
    "num_comments": 0,
    "created_datetime": "2025-04-10 01:53:23",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvmmnn",
    "title": "“Beta women” ruined me",
    "selftext": "The sad thing is that I still crave it even though it would fuck with my head if I got back into it.  When it comes to sexuality the most arousing thing used to be giving myself up completely.  Switching between bdsm, free-use, and cnc.  I had the illusion of being safe while participating in something so dark and twisted.  I loved letting go and figuratively being in a free fall with someone there to catch me.  For someone to be obsessively infatuated with my body.  To truly want me and do everything with me.  I actually felt important for once.  For them to hurt me and pleasure me and manipulate me and teach me poke and prod me…then be there for the aftercare, receiving so much ‘love’ and affection and praise.\n\nBut dominants don’t really care for long.  They only stick around to get what they need, and dip.  Because none of them actually want a monogamous and committed relationship.  None that I have gotten to know.  It goes against their domination.  There is a reason behind their sadistic nature and aggressiveness and need for control.  It may just look like an outlet for release, but I think there is so much it tells about a person.  To treat someone like a personal punching bag and owned 24/7 flesh-light.  If you want to do that to someone…who knows what else you want to do and who you want to do it with.  How extreme you must take it, before you get bored and find someone else more subservient or you have another fantasy in need of fulfilling.  The many pictures in your porn catalogue, the many sites you visit, the many women you chat with, the many women you hook up with.  \n\nIt also calls into question my mentality.  Why do I value male validation so much?  Why do I want them to tell me what to do and what will be good for me?  Why do I want a male protector or owner so bad?  Why do I want someone to fix my boo boos when I should know better, that they really can’t.  \n\nMy low self esteem once aided me in being of service.  I loved being a good girl.  But I am too broken now.  I’m broken to the point where I don’t trust any master anymore.  I don’t trust caretakers.  I don’t trust older men.  I don’t trust younger men.  I don’t trust compliments anymore.  I don’t trust any hand that reaches out for me.  The fairytale ended and i’m passively suicidal.  If someone actually loved me they would be by my side right now.  Physically.  I would get that hug I always wanted for years, without having to beg for it.  There would be no limit.  No excuses.  Instead I am crying alone as it will always remain.  The antidepressants haven’t helped much.  It feels like too much is missing in my life in order to be happy.  I look in the mirror and see this ugly person.  There is so much suffering going on that I feel guilty for even wanting to play into my delusional fantasies.  ",
    "score": 0,
    "upvotes": 0,
    "num_comments": 2,
    "created_datetime": "2025-04-10 01:46:56",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvmk80",
    "title": "I'm tempted to tell if my old therapist.",
    "selftext": "The one who insisted that I write an emergency contact plan that included him, and then refused to take the call when I called.  Technically, I didn't call him, it was my case worker, or whatever the word for it is.  I forgot the exact word for her job.  But she wouldn't take the call.  Wanted to know why I hadn't just called emergency services.  I attempted suicide behind their back several times after that and never told them.\n\nI kinda feel like they failed me and that was my last chance to really get well.  That wasn't the only mistake they made.  \n\nI'm thinking of killing myself, and I just kinda want to tell them if beforehand.  This is stupid, right?",
    "score": 2,
    "upvotes": 2,
    "num_comments": 6,
    "created_datetime": "2025-04-10 01:43:11",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvmig8",
    "title": "I don’t wanna work",
    "selftext": "I just wanna sleep, and get lost in fantasy, and eat, and drink, and jerk off, and watch movies, that’s all I wanna do, I just wanna escape this world, this reality, this life, all I’ve wanted is an escape",
    "score": 1,
    "upvotes": 1,
    "num_comments": 2,
    "created_datetime": "2025-04-10 01:40:20",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvmhjo",
    "title": "I can't live with what I've done",
    "selftext": "I've hurt so many people to a point my bestfriend left me. Yesterday during a party i got so emotional i shouted and exploded at her in front of evergone which lead her to texting me that she didn't want to do anything with me. Then today my mom and i had a huge argument wherein she told me she hated me and called me names because i wouldn't talk to anyone. Some of my friends who are still by my side try to comfort me but its hard for me to move past what i did. I want to apologize to everyone and repent. I miss my bestfriend and i miss feeling at peace. I keep thinking to myself maybe i am a good person but i know to myself my actions don't reflect that.",
    "score": 1,
    "upvotes": 1,
    "num_comments": 1,
    "created_datetime": "2025-04-10 01:38:58",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvmeql",
    "title": "Coming Back",
    "selftext": "Has anyone had progressively worsening suicidal thoughts and turned it around before committing. Mine are getting worse and worse. I have such a good life and it makes me feel ashamed to be suicidal. I’m married, have two perfect children, a well paying job, education. Truly a wonderful life. But the pressure is so much. I think the only reason I’m still here is my wife and kids. What do I do? Pleases help.",
    "score": 1,
    "upvotes": 1,
    "num_comments": 0,
    "created_datetime": "2025-04-10 01:34:47",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvmcsd",
    "title": "God has such a sense of humor writting my life.... i just wish I weren't the victim of the joke.",
    "selftext": "Once God allowed me the strength to defeat a lifelong porn addiction, put the most loving and kind woman anyone can think of in my life. He showed me how good life could be and I devoutly answered in living like a devout christian... just to make me have a breakdown, anger her forever, relapse, develop bipolar disorder , reignite my gender dysphoria when my parents would rather see me dead than as a woman WHILE ALSO having to put my entire life behind a vestibular (entrace exam) I can barely study due to my mind betraying me half of the time and procastinating... FOR TWO YEARS ALREADY. \n\nI will soon be 18 yet I already failed everyone that cared about me, from God to my family to my Love... they are all gone in a pratical sense, I have nothing, life is nothing... thoughts of death have been hauting me yet I'm too much of a coward to just jump out of my apartment and go way.... why God? Why did you show me heaven to then throw me in hell? I just don't want to be alone, i don't want do die....\nplease... i need help",
    "score": 36,
    "upvotes": 36,
    "num_comments": 5,
    "created_datetime": "2025-04-10 01:31:48",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvmcha",
    "title": "I hate it when even the LGBT community invalidates my trans identity",
    "selftext": "Other trans and gay people see me and judge me for looking like a man. Like I try putting on make up and wearing dresses because I do want to look like a women.\n\nIt triggers me so much looking at the mirror because I look like a man. My voice triggers me too. And there's these people triggering as well.\n\nI just want to end it. I don't see any of these changing. Like people don't really believe i want to be a woman. ",
    "score": 0,
    "upvotes": 0,
    "num_comments": 2,
    "created_datetime": "2025-04-10 01:31:21",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvmbb8",
    "title": "I’m tired",
    "selftext": "I just lost my life savings in the stock market and I want the pain to end\n\n22(M). I live alone and work a 45k a year job for over a year. I have slowly been saving and saved close to $10k which I then proceeded to lose over the course of the past week. \n\nI think I really just wanted to feel something and that dream of striking lucky is so powerful. \n\nNo one in my family knows this and I genuinely feel like this is the end for me. I have no special skills, goals or many friends I don’t know what to do.\n",
    "score": 1,
    "upvotes": 1,
    "num_comments": 1,
    "created_datetime": "2025-04-10 01:29:41",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvmahd",
    "title": "would someone actually gaf if i died",
    "selftext": "If i did it, it’d be selfish, i remember i tried once, and some group of people knew it was some group for game deving or something. when i got online after a while which i shouldnt have so soon i admit, i just wanted to talk to someone and maybe make sure nobody kept freaking out and this guy said how, good that im alive and that ‘nobody here deserves that’ refereing to, having to deal with me dying, killing myself.\n\nSo is this what itd be about if i died? The pain other people feel? Why would they feel pain if everyone in this world just thinks of me as a nobody, or a fucking lunatic. Or just a damn annoying kid. I already showed warning signs i did im fucking all alone and no stranger will give a fuck.\n\nIm burdening my partner with my sick self, my mood never fucking improves, im just weighing him down. My bf deserves someone better. \n\nI dont think anyone would gaf if i died. \n\nPeople can know what im thinking about but they wont know how painful it is, when my mind literally feels like static and everything feels like its pulling me like my brain has exposed nerves rubbing against my skull, thats how it feels like when i get the urge to kill myself. And i wait and wait and nobody comes for me.\n\n\nIm so fucking deprived of human contact, i just wish i was allowed to have that.\n",
    "score": 1,
    "upvotes": 1,
    "num_comments": 1,
    "created_datetime": "2025-04-10 01:28:24",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvm62k",
    "title": "I really want to. I have nothing and my family is so abusive physically and emotionally.",
    "selftext": "Antbody actually have found help?",
    "score": 1,
    "upvotes": 1,
    "num_comments": 2,
    "created_datetime": "2025-04-10 01:21:50",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvm2nu",
    "title": "If things keep going like this in going to be gone soon.",
    "selftext": "I don't have a day or time, but everything is getting so tiring and I have no one to talk to, and I'm trying to escape some things but am not able to (like school, I'm being harassed) my siblings aren't on talking terms with me because I swear, and I don't understand what the fuck is going on. I used to be so scared of death, now its just a reoccurring thought that I consider all the time. Will it pain me if I leave my pets? Hell fucking yes. Might me leaving be my only choice? I'm starting to think so.",
    "score": 1,
    "upvotes": 1,
    "num_comments": 0,
    "created_datetime": "2025-04-10 01:16:55",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvlz09",
    "title": "does this count as ana or not? (TW, detail of possible ana, and \"stereotypical ana behaviour\" ykwim) everywhere is shit so im here.",
    "selftext": "Does this count as Anorexia? so basically, ive started counting calories, forcing myself to walk a lot to the point where i cant breathe sometimes, body checks, trying to avoid food, trying to go days without eating, always feel fat, but im not underweight. When i go to the drs and they weigh me they tell me that im a normal weight. but i dont look disordered, and i dont look ill either. Is it Ana, or just body image issues?",
    "score": 1,
    "upvotes": 1,
    "num_comments": 0,
    "created_datetime": "2025-04-10 01:11:39",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvlyqv",
    "title": "How bad is electrocution",
    "selftext": "Theres an am radio tower near my school im actually just gonna go touch it if tomorrow if i  dont get a reason to stay alive",
    "score": 1,
    "upvotes": 1,
    "num_comments": 3,
    "created_datetime": "2025-04-10 01:11:17",
    "subreddit": "suicidewatch",
    "category": "new"
  },
  {
    "id": "1jvcurr",
    "title": "Am I mentally ill just because I don't wanna live like a slave? I'm done here.",
    "selftext": "I'd literally rather die right now than having to wake up to work for the rest or my fucking life. Is it really that hard to understand? Because everyone is looking at me like I'm out of this planet. There's no other option. \n\nI can't decide whether to die from helium poisoning or get beheaded by train. \n",
    "score": 442,
    "upvotes": 442,
    "num_comments": 69,
    "created_datetime": "2025-04-09 18:22:22",
    "subreddit": "suicidewatch",
    "category": "hot"
  },
  {
    "id": "1jvalt1",
    "title": "I'm only still alive because I don't have the courage to kill myself",
    "selftext": "it would be so quick. It wouldn't be painless, but it would be quick.\nBut I don't have the courage to do it\nAnd because of that, I have to keep living and suffering\n\nI wish someone kills me. Everytime I go out for a walk I fantasize about someone shooting me",
    "score": 116,
    "upvotes": 116,
    "num_comments": 33,
    "created_datetime": "2025-04-09 16:52:01",
    "subreddit": "suicidewatch",
    "category": "hot"
  },
  {
    "id": "1jvesbf",
    "title": "If i had a gun, i would have killed myself every single day",
    "selftext": ".",
    "score": 62,
    "upvotes": 62,
    "num_comments": 12,
    "created_datetime": "2025-04-09 19:41:43",
    "subreddit": "suicidewatch",
    "category": "hot"
  },
  {
    "id": "1jvh0o4",
    "title": "Everyone says ''But your family and friends...''",
    "selftext": "So what??? Should I live in misery and pain and be sad all the time just to prevent their sadness? I don't want to be a hero, no thanks. I just want to end my pain for good",
    "score": 37,
    "upvotes": 37,
    "num_comments": 2,
    "created_datetime": "2025-04-09 21:15:21",
    "subreddit": "suicidewatch",
    "category": "hot"
  },
  {
    "id": "1jvbg8j",
    "title": "Hi guys. I need someone to talk to please. Anyone just have 5 minutes of their time",
    "selftext": "Can I please just talk to someone who doesn’t know me. I need to vent out but I have no one. Please please please",
    "score": 47,
    "upvotes": 47,
    "num_comments": 30,
    "created_datetime": "2025-04-09 17:26:27",
    "subreddit": "suicidewatch",
    "category": "hot"
  },
  {
    "id": "1jvl0tx",
    "title": "My suicide note",
    "selftext": "“I hope that my absence brings you peace and eases whatever burdens my presence may have caused. It will be difficult at first, especially in the coming months, but in time, I believe you will all find a way to move forward”\n\nLater, when I get home after duty. I will severe my jugular vein. I wish I had Lidocaine on me but anyway I’d still do it. \n",
    "score": 9,
    "upvotes": 9,
    "num_comments": 3,
    "created_datetime": "2025-04-10 00:22:23",
    "subreddit": "suicidewatch",
    "category": "hot"
  },
  {
    "id": "1jv1w8t",
    "title": "I sext randoms online to make me feel something. In reality I just want to die.",
    "selftext": "I post pictures of everything on my alt. In my real life, my husband makes me feel worthless. Any imperfection in the house is a reflection on me. He’s never liked my jokes.\n\nHe acts like he hates me. You know when you meet someone, and everything they you think, “omfg why are you talking?” That’s how he makes me feel every time I open my mouth. Like I’m Toby, and he’s Michael. \n\nSo my kids destroy the house. Yeah, they’re kids. It happens. But I’m fucking exhausted. No help. I’m trying to put out fires as more pop up. \n \nMy husband is so angry at me every time he comes home. I’m scared when he comes home. He doesn’t hit me, but the way he berates me over everything breaks me down. \n\nI should have gone before I got married. Before I had kids. My husband knows he can’t handle them alone. Maybe they’d go to my sister or my mom. Maybe they’d be better if I was gone. ",
    "score": 139,
    "upvotes": 139,
    "num_comments": 20,
    "created_datetime": "2025-04-09 09:47:32",
    "subreddit": "suicidewatch",
    "category": "hot"
  },
  {
    "id": "1jvb7vo",
    "title": "I don’t necessarily want to die but I have to. There’s no alternative.",
    "selftext": "I’ll never escape poverty. It’s just over. I work full time and I’m a full time student. None of my money is mine. I can’t progress, I can’t get ahead, and I can’t rest.\n\nNothing good has ever happened to me. I’m just tired. I can’t go on with this life.\n\nI have no choice other than to kill myself. There’s nothing I can do.",
    "score": 36,
    "upvotes": 36,
    "num_comments": 28,
    "created_datetime": "2025-04-09 17:16:54",
    "subreddit": "suicidewatch",
    "category": "hot"
  },
  {
    "id": "1jvgsh2",
    "title": "i’m scared i‘ll go to Hell",
    "selftext": "**PLEASE** do not put your two cents in if all you have to say is God or Heaven and Hell aren’t real, this is not the place for that. i respect whatever opinions everyone has. i don’t and never will expect everyone to agree on terms of spirituality. i value that not all people share the same exact ideas on spirituality.\n\nthis is a matter of MY spirituality. \n\ndespite struggling with s.i. for the past 10 years, i have stayed alive solely for my family and out of fear that i will go to Hell for killing myself. but i am beginning to care less and less. i am sick of feeling trapped and terrified every single day. i am sick of suffering so others don’t have to. \n\ni want to finally be selfish. i want to beg my family to forgive me and understand this is what i need and want. and if they don’t, oh well. i also want to believe God will understand and forgive me and finally let me find rest in an eternal, safe place.\n\ni pray. i read scripture. i go to therapy. i take meds. i’ve been hospitalized twice. i do it all. still, everyday i absolutely yearn to kill myself. the dread and pain physically hurt. i truly truly truly cannot take it anymore. ",
    "score": 15,
    "upvotes": 15,
    "num_comments": 18,
    "created_datetime": "2025-04-09 21:05:45",
    "subreddit": "suicidewatch",
    "category": "hot"
  },
  {
    "id": "1jvj69s",
    "title": "I dropped out of college and am gonna end things tomorrow",
    "selftext": "I am 22. When I was a teenager, I went through some not-so-fun things that really stuck with me. When I graduated high school, I was determined to pursue my veterinarian dream and be in a safe, stable place. However, I got diagnosed with cancer right after graduation. I ended up taking a gap year after failing courses at community college. During this time, my boyfriend left me and I really don’t know where my family was. My dad would tell me how I was failing in life and my mom felt annoyed with how absent I was during that time. I didn’t have a future anymore. I attempted to end my life at 19 (not gonna get into detail). However, I survived (obviously) and I never told anyone and sorta just moved on. Suicidal thoughts? Yeah I tried that, it didn’t work. I eventually went into remission and enrolled back in college, got an associates degree, and transferred to a small university.\n\n\nI was adapting well. My grades were better and I even made some friends! However, this semester (second semester at this school) was rough. Some stuff happened and I became depressed. However, what really made me reflect was when I was in my biochemistry professor’s office hour. Me and my classmate were in there, and my classmate started talking about her battle with depression. I tried to be supportive, but then she mentioned she was suicidal. She said she wanted to end herself cause she got a C in organic chemistry. She mentioned she had so much support from friends and family, and that she was able to overcome her situation and do better in college. I remembered my attempt (didn’t share or anything). And I remembered how lonely I was during that time. I was (sorta) in the same shoes as her, except I didn’t really have anyone. I think I started feeling sad again over the whole ordeal. Realized my trauma was not really resolved. And now I’m here. I probably won’t end my life, but I just feel numb. I skipped classes today, I have a test tomorrow and idk haven’t studied. I feel sorta alone. I guess that’s what I’m struggling with. ",
    "score": 11,
    "upvotes": 11,
    "num_comments": 8,
    "created_datetime": "2025-04-09 22:51:07",
    "subreddit": "suicidewatch",
    "category": "hot"
  },
  {
    "id": "1jva0ba",
    "title": "If suicide wasn't painful I'd do it.",
    "selftext": "I've had enough of living, everything i worked for gone in a flash, my mental health and ptsd has taken over.\n\nI am on the brink, I just have the voice saying to jump, yet i don't im afraid of pain, and committing suicide means pain if only it was painless.\n\nI looked in to overdosing but even that is too much effort these days and painful if I fail even if I succeed there'd be a painful moment of hours before coma. Then I gotta hope I'm brain dead.\n\nWhy is it so hard to just have a clean wipe off from the planet.",
    "score": 33,
    "upvotes": 33,
    "num_comments": 9,
    "created_datetime": "2025-04-09 16:27:37",
    "subreddit": "suicidewatch",
    "category": "hot"
  },
  {
    "id": "1jv186w",
    "title": "Please.Anyone.Help me.Im so fucking affraid.I want to die so badly.",
    "selftext": "Again,me,12F.I think my second post can provide some context.TW:Paraphilia and very disturbing stuff.I'm so sorry for existing.\n\n\n\n\nIt's all going down again,I'm crying my eyes out right now.I though it was getting better but now I'm absolutly scared about having done anything that would make me a s€xual offender.As I said in my first post here I was groomed at 10 and I was exposed to all kind of very disturbing p€rn even younger and gore.I'm very messed up,very,very messed up.\n\n\nSo now I just remembered I had drew some p€rnographic stuff.I don't think it was of a child or something but now I'm scared.I don't remember.What if I had drew CP?WHAT IF I DID AND DIDN'T REMEMBER.I don't remember who I drew I don'teven think it was anyone in particular.Does that makes me a fucking disgusting gross and unsavable p€do.I'm scared.I don't think it was but I don't know why I got this though this morning.I'm scared shitless.What if I had done an offence.I was also exposed to child p€rn.Since I was groomed I though all that stuff was normal.Please help me I'm planning on doing something bad to myself.Please help me I beg of you all I'm so scared.I'm twelve and what if I was already unfixable.I'm scared shitless.I don't deserve to live,right?I wanna die.I'm so scared.I'm sorry for being here.Maybe I'm selfish for asking for help but I'm so fucking affraid.What If that though was true.I'm sorry mom,I'm so fucking worthless,I'm so disgusting.I don't want to live anymore,each time I think I have no problem,I get my life ruined.I hate myself so much.How did I not know it was so wrong....\n\nNote:I also can't get help right now.That's why I'm very panicked.And well,my parents don't completly beleive in modern medecine(And therapists),unfortunatly.Yeah....Again I repeat I didn't know all that stuff mentioned in the two posts were wrong.I even wanted it to happen to me,so I genuinly viewed myself sexualy too as a kiddo.I'm still so sorry for being so gross.I'm just here to try become a better human being even though I wasn't the best in the past.",
    "score": 128,
    "upvotes": 128,
    "num_comments": 15,
    "created_datetime": "2025-04-09 08:58:21",
    "subreddit": "suicidewatch",
    "category": "hot"
  },
  {
    "id": "1juxr3r",
    "title": "lmfao youll be fighting for your life and a man will come along being sexual",
    "selftext": "🤣🤣🤣🤣🤣🤣 ive never wanted to die so bad",
    "score": 217,
    "upvotes": 217,
    "num_comments": 49,
    "created_datetime": "2025-04-09 04:48:11",
    "subreddit": "suicidewatch",
    "category": "hot"
  },
  {
    "id": "1jvduy6",
    "title": "Please fucking shoot me",
    "selftext": "I have nobody to help me, no friends no family no nothing. no hope of a good future, lost my girlfriend of 4 years wouldve been 5 in june, my parents hate me and I feel like I wasted majority of my life already, im just ready man.",
    "score": 15,
    "upvotes": 15,
    "num_comments": 2,
    "created_datetime": "2025-04-09 19:03:09",
    "subreddit": "suicidewatch",
    "category": "hot"
  },
  {
    "id": "1jvimxr",
    "title": "Do I deserve to live?",
    "selftext": "I think I was just overreacting my whole situation. Just because I was tired a little bit, I let it get to my head and started cutting, quit my school, and now I’m even addicted to overdosing. I’ll never make it as an adult. Should I keep living just to be more burden to my family or should I live like a bum before I end it all?",
    "score": 7,
    "upvotes": 7,
    "num_comments": 5,
    "created_datetime": "2025-04-09 22:26:32",
    "subreddit": "suicidewatch",
    "category": "hot"
  },
  {
    "id": "1jvdsnq",
    "title": "Autism",
    "selftext": "I hate being autistic. People forget that autism is a spectrum and falsely believe that we don’t understand emotion or care for others. I am hyperaware and hypersensitive to other people’s emotions and reactions to me. I know I act differently, that I am a little quirky. When I do something wrong, I get so embarrassed and hung up about it for days. I made a mistake at work the other day and my coworker corrected me and I cried when I got home because of the embarrassment. I get so overwhelmed so easily. I feel like my mind can never be quiet for just a moment, I’m always inundated with embarrassing memories that make me feel like a failure. I’m so tired of living like this. I hate that I act differently and that people treat me differently which causes me to embarrass myself. I don’t want to be autistic anymore. I just don’t want to live anymore if this is going to be my life.",
    "score": 12,
    "upvotes": 12,
    "num_comments": 0,
    "created_datetime": "2025-04-09 19:00:51",
    "subreddit": "suicidewatch",
    "category": "hot"
  },
  {
    "id": "1jvik5r",
    "title": "My kid is the only thing keeping me from blowing my Brains out.",
    "selftext": "I’ve been through a lot of shit in my life and recently I just got out of an abusive relationship with my babymother. She kicked me out twice out of her house and threw all my shit out the door, beat me and emotionally manipulated me. Now I’m back at my parents house and I have to deal with my also emotionally abusive mother and I don’t feel comfortable at home. I just want to blow my brains out so the stress can end but my kid is the only reason why I’ve kept myself sane and not shoot myself or jump off a bridge. My unborn kid is everything to me and I will keep myself sane just for their sake. Maybe I will do the job once they’re 18 and move out or I don’t know. ",
    "score": 6,
    "upvotes": 6,
    "num_comments": 1,
    "created_datetime": "2025-04-09 22:23:00",
    "subreddit": "suicidewatch",
    "category": "hot"
  },
  {
    "id": "1jvjel9",
    "title": "i’m such a parasite",
    "selftext": "i feel so guilty for wasting everyone’s time and not contributing anything. i’m completely useless. ",
    "score": 4,
    "upvotes": 4,
    "num_comments": 2,
    "created_datetime": "2025-04-09 23:01:51",
    "subreddit": "suicidewatch",
    "category": "hot"
  },
  {
    "id": "1jvkptu",
    "title": "I have no future.",
    "selftext": "I’m (18F) about to take my A-Level exams in May and June and I know I’m going to do terribly. So when I first started college I, (at the time 16) didn’t really know what I wanted to do with my life, so I chose three subjects which I didn’t know I would be terrible at. Now I have to pay the price for this. During my time at college I got caught up in partying, heavy drinking and being in several friendship groups. Despite this I’ve never had a true friend my entire time here. I’ve had my Anorexia be an on and off thing throughout my time and when I’m not starving I’m bingeing, this caused me to become severely depressed and therefore lonely, doomscrolling every night on my phone, blaming my loneliness on my personality, weight, face, voice (anything under the sun basically), which has now caught up with me. My teachers all seem to think I am extremely dumb, and yes at times I am lazy but I had to battle depression whilst being an average student, because they don’t know I was depressed they just think I’m lazy and stupid. Now I’m a few weeks away from my exams and everything has caught up with me. Even thought I study more now than I used to, my grades have gotten worse. I have applied for universities and have received offers, but I don’t think I will get into any when I get my grades. How do I prepare to disappoint my family? Or should I just end it before I get the chance to? Please somebody help I’m losing sleep over what I can do in the future!!  ",
    "score": 5,
    "upvotes": 5,
    "num_comments": 1,
    "created_datetime": "2025-04-10 00:06:17",
    "subreddit": "suicidewatch",
    "category": "hot"
  },
  {
    "id": "1jv6jfi",
    "title": "I don’t want to live but I don’t want to die either",
    "selftext": "I wish I was never born. I don’t like existing. It’s hard. I didn’t choose to exist and now I’m here, stuck with myself (I hate her) and with a life I don’t know how to live. I don’t know what to do with it. I’m young and I have to figure everything out . The problem is: I don’t want to. I don’t even think I am able to. I’m so tired. The worst part is: all this pain, this suffering and then? Aging. Dying. Life sounds like prison and torture to me, it doesn’t make any sense",
    "score": 24,
    "upvotes": 24,
    "num_comments": 6,
    "created_datetime": "2025-04-09 14:02:27",
    "subreddit": "suicidewatch",
    "category": "hot"
  },
  {
    "id": "1jvij5c",
    "title": "I just wanna be heard",
    "selftext": "I'm here all alone by myself, and this thoughts of ending it all, I come here to give some support to the the people that need another human being that hears them, and my heart breaks seeing us all in the same boat, i think I just wanna feel like shit, seeing other Humans that also feel like shit, I wish you all the best and I hope every single one of you reading this to see the next day. ",
    "score": 5,
    "upvotes": 5,
    "num_comments": 1,
    "created_datetime": "2025-04-09 22:21:41",
    "subreddit": "suicidewatch",
    "category": "hot"
  },
  {
    "id": "1jvk158",
    "title": "Unfortunately for me I didn’t kill myself today",
    "selftext": "I had the perfect opportunity to do it. I was finally home alone for longer than an hour which almost never happens these days. I got everything ready and semi? attempted but I just can’t do that to my family. They are the only reason, a good reason, that I didn’t go through with it. My family, probably my mom, would have been the one to find me and I just can’t traumatize them like that again but worse. This doesn’t make me want to die any less than before, I still so desperately want to die. Part of me wishes I didn’t care and just did it. If I can find a more peaceful way to go that makes it look like I just fell asleep I think I would be much less hesitant. Just because I didn’t do it to save my family from the unbearable pain doesn’t make me want to live, things haven’t changed for me. I still feel so hopeless and helpless and sad and angry and miserable. The pain is so constant and unbearable. I wish I just did it. I wish I just ended my pain. It is not fair that I have to live in this mental agony in order not to hurt my family. I will still constantly hope and beg and plead and wish to die in (almost) any other way so I can still die without having to choose to do it myself and having to devastate and traumatize my family more than my death would already cause. Please just let me die. Living is torture. Please let me get a terminal illness this month or die in a car crash this week or let me get fatally shot today or anything that will kill me. Please I am begging to be put out of my misery.",
    "score": 6,
    "upvotes": 6,
    "num_comments": 3,
    "created_datetime": "2025-04-09 23:32:06",
    "subreddit": "suicidewatch",
    "category": "hot"
  },
  {
    "id": "1jvft45",
    "title": "Every day I regret not killing myself",
    "selftext": "Every single day I regret not killing myself. I hate myself. I hate the way everyone in my life treats me. I hate that everything I do is wrong. I hate being alive. The only reason I am not dead is because I need to take care of my cat, everyone else I know is too selfish and neglectful to treat him like a living creature.  Once he passes away im killing myself.  I have nothing to look forward to. I have nothing of meaning to took back on.  Every single day is full of constant suicidal thoughts.  Every single conversation I have with a family member involves putting me down and telling me how much of a failure I am.  They tell me I’m lazy because I don’t work every single day, even though they gave both of my brother free cars, one of them doesn’t even have a job and has no reason to have a car.  My dad constantly fat shames me, acting like I’m morbidly obese, I’m barely 15lbs over average.  If I had walked a mile and back to the store and bought myself a drink, he’d say “there better not be food in that bag”, oh but if o eat less and exercise then I get accused of being anorexic. They’re the reason I didn’t get to go to college last year, not like there’s even any point of going anymore.  I wish everyone would just shut up about all the things I need to do, because none of those things matter when you’re going to be dead in a couple years.  My mom constantly acts like I’m burdening her but I’m the only one who does the grocery shopping, I spend all my money and can’t save any of it. I do all the cleaning, cooking.  If I leave a window cracked in 65° weather to let fresh air in, I’m gonna “freeze her guinea pig to death”, she acts like she’s cares about that thing but let’s it rot in its own filth, tells me to clean it if I’m so bothered by the smell, I’m severely allergic to it.  I wish I could just disappear, take all my things and my pets, start over and never see any of these people again.  I’m trapped and the only way out is to die. I already know they’d cry, asking “why” saying “im sorry” as if they don’t know they’re the reason. It’s not like I was a bratty devil child who ruined their lives.  I had a 4.15 gpa, I got accepted into college, I never smoked or drank or partied, I never snuck out, but once I got depression no one helped me, everything I accomplished went away. In senior year I went from straight A+s to failing all my classes, I stopped going to school, have a bunch of my stuff away. My mom abandoned me and made me live with me stepdad who sexually abused me with I was 7-13, so she could spend all her time with her boyfriend the same age as me.  She’ll say she was “helping people” in rehab, she was helping a drug addict whose baby was born addicted to herion get her kids back. I remember an instance where I was having a cystitis flare up at school, (part of the reason I stopped going) and my mom took hours to pick me up and take me to urgent care because she was too busy with her friends. When she did pick me up she treated me like I was over reacting and took her and her friends kids to McDonald’s before taking me to get urgent care. I never got treatment for my cystitis and I permanently suffer from untreatable symptoms.  I’m still a good person, I give my extra money to people who need it, I still take care of my mom when she needs it even though she doesn’t deserve it, and would never do the same for me.  I am empathic to other people and animals, I always use my manners, I tip good at restaurants.  If I was raised by someone who loved me unconditionally everything would’ve been different. I hope no one finds my body",
    "score": 7,
    "upvotes": 7,
    "num_comments": 3,
    "created_datetime": "2025-04-09 20:23:56",
    "subreddit": "suicidewatch",
    "category": "hot"
  },
  {
    "id": "1jvkt1t",
    "title": "Immortal?",
    "selftext": "I don’t know what the fuck is going on. I took like 180 mg of Adderall at midnight last night. I planned to just be gonezo today. I feel fine. No symptoms of anything serious, except insomnia and no appetite (stimulant vibes(I have eaten tho)), nausea, fatigue, mild neck pain, and a mild pressure on my temples. Oh, a red splotchy spot appeared on my soft palate, but I’m pretty sure that’s unrelated. I’ve OD’d 6 times in my life. Once on Zoloft (300 mg), Tylenol twice (6000 mg & 8000 mg(seriously, wtf)), Phentermine (6 37.5 tabs, so 225 mg), and Ibuprofen twice (4000 mg & 6400 mg). Liver is functioning normally, no concerning labs. Kidneys are good at 96 egfr. No sign of brain damage. Only shit I’ve developed in the past 12 months health-wise is my lil butterfly rash and raynaud’s. Prolly lupus, but that’s the least of my concern rn. Still wanna get outta here, but why do all my goddamn attempts fail?! I’m fucking miserable. Why can’t I JUST DIE?! Am I being forced to stay here against my will?! Who is controlling this game of sims?????!!!!!!!!!!\nEdit: this is actually bullshit and so fucking unfair",
    "score": 4,
    "upvotes": 4,
    "num_comments": 2,
    "created_datetime": "2025-04-10 00:10:58",
    "subreddit": "suicidewatch",
    "category": "hot"
  },
  {
    "id": "1jv9kz3",
    "title": "i cant even kill myself",
    "selftext": "i dont want to die. i want to disappear. i want it to be like i never even existed in the first place. all my life i struggled and suffered. and i couldnt even tell anyone because i didnt want to be a burden. i didnt want my own feelings to hurt others, to bring their mood down. i kept everything to myself and i dont think i will be able to anymore. i dont want to kill myself and make people cry over me. because i tried so hard to not make people feel that way. imagine struggling to live because you dont want to make people sad by opening up all for it to end in you killing yourself and making people sad. would be ironic. ",
    "score": 13,
    "upvotes": 13,
    "num_comments": 3,
    "created_datetime": "2025-04-09 16:10:07",
    "subreddit": "suicidewatch",
    "category": "hot"
  },
  {
    "id": "1jv9wyb",
    "title": "No more empathy left in this world",
    "selftext": "There is no hope. There is no hope. There is no hope.There is no hope. There is no hope. There is no hope. There is no hope.There is no hope. There is no hope. There is no hope.\n\nI am just words on a screen to all of you. I'm not a person. You don't know who I am, where I'm from, what I look like, what I want most in life. Would you really weep and mourn the death of someone you don't know at all? \n\nI'm tired of losing hope. Of thinking it's gonna get better when it's not, because I am a horrible person and a hypocrite. I keep grasping at straws, but it will never change. I'll always be emotionally alone and maybe that's just what I deserve.",
    "score": 11,
    "upvotes": 11,
    "num_comments": 1,
    "created_datetime": "2025-04-09 16:23:49",
    "subreddit": "suicidewatch",
    "category": "hot"
  },
  {
    "id": "1jvkhgr",
    "title": "I don’t see a point in going on with my life",
    "selftext": "I’ve made so many mistakes I won’t be able to come back from because of the constant reminders, I genuinely hate my life I’m constantly unhappy and getting up in the morning is agonizing I often wish I could just pass in my sleep so I wouldn’t have to worry about any of this anymore, I was in  therapy  for a bit but it didn’t help at all because I couldn’t be honest with her I can’t be honest with anyone I lie to cover up who I am but I myself don’t know who I am. I just wish I didn’t have to go through this feeling anymore. I didn’t even believe id make it to 16 but now I’m 18 and I think I’ve had enough \n",
    "score": 4,
    "upvotes": 4,
    "num_comments": 2,
    "created_datetime": "2025-04-09 23:55:07",
    "subreddit": "suicidewatch",
    "category": "hot"
  },
  {
    "id": "1jvk8hl",
    "title": "I don't know anymore",
    "selftext": "I always keep on convincing myself that I'm the happiest ever, I've went through a lot, I didn't live that much tho, maybe too young, and people will still justify my feelings with teenage. \nI am happy, but I don't know how, I can't stop myself from feeling empty, and I keep on realising everyday that I'm feeling so sad for no reason, and I just shrug it off, because nothing is happening to me in my life. \nI might be lying, I'm living in an illusion where anything shouldn't be a reason for my suffering, and that it's all coming from me, suppressing everything within me, I can't express my feelings or separate them from my thoughts, everyday feels like nothing, but it's bright in a weird way, I seek comfort and attention from others but I can't afford it to myself, I can't love myself properly, anxious all the time and I prefer isolating myself, I do go to therapy but in order to heal from social anxiety, which made me feel more overwhelmed, but I yet keep on convincing myself that it's for the best, sometimes it gets so bad I just feel desperate to end it all, but I blame myself for thinking that way, pushing myself and just cry, I don't know anymore.\nI'm going to sleep, and when I wake up, it's going to vanish, and I'm going to live my sweet daydreams again, where I'm obliged to be better, I don't want these feelings but that's every thing for me, I have nothing in within myself but that, yet someone will just call it a teenager thing at this point, and I won't even say no or try to prove myself, it feels like some unrealistic hope, like \"yes, I'm a teenager, and in few years I will live to live again\". I hate myself, and it's not new, I doubt that I ever loved myself properly once, I'm already becoming an adult this month, only legally tho, either it ends or I keep on falling into this emptiness\n(English is not my first language ) ",
    "score": 3,
    "upvotes": 3,
    "num_comments": 1,
    "created_datetime": "2025-04-09 23:42:22",
    "subreddit": "suicidewatch",
    "category": "hot"
  },
  {
    "id": "1jvi18n",
    "title": "If I had a gun rn I’d do it",
    "selftext": "I just dont wanna live anymore I just hate my life so fucking much, I dont want to have to spend another day rotting away in my shitty house with 0 friends and 0 things to do",
    "score": 4,
    "upvotes": 4,
    "num_comments": 3,
    "created_datetime": "2025-04-09 21:59:33",
    "subreddit": "suicidewatch",
    "category": "hot"
  },
  {
    "id": "1jvi01y",
    "title": "600mg of trazodone. Good idea or no?",
    "selftext": "I'm scared but I feel like I want to. I should call for help but I have too much anxiety to do it. I wish I was home alone right now, then I'd be able to od comfortably. Tell me if this is a good idea or not.",
    "score": 4,
    "upvotes": 4,
    "num_comments": 9,
    "created_datetime": "2025-04-09 21:58:02",
    "subreddit": "suicidewatch",
    "category": "hot"
  },
  {
    "id": "1jvk0hz",
    "title": "I'm so exhausted",
    "selftext": "Every single day just feels so pointless. I don't understand why I'm even still here. I'm constantly dissociated. I can't even clean my room or do one assignment from school without feeling tired. I relapsed hard into SH the other day and nobody knows. I feel like I can't tell anyone because I don't wanna be a burden and my family never seems to actually care. I feel so ugly and I've been starving on purpose as a way to harm myself. I've been sexting with strangers just to feel something but I just feel ashamed now\nI want to end it so badly but I can't even bring myself to do it. I just don't understand what the point of life is if I'm stuck in bed all day and constantly depressed. I've tried almost everything to make myself feel better but it never goes away. I don't know what to do\n",
    "score": 3,
    "upvotes": 3,
    "num_comments": 1,
    "created_datetime": "2025-04-09 23:31:13",
    "subreddit": "suicidewatch",
    "category": "hot"
  },
  {
    "id": "1jvjzg4",
    "title": "I’m going to kill myself",
    "selftext": "I’m fat and ugly and stupid and so late and behind in life. I am trash and I just want to die. Please just let me die already. ",
    "score": 3,
    "upvotes": 3,
    "num_comments": 1,
    "created_datetime": "2025-04-09 23:29:54",
    "subreddit": "suicidewatch",
    "category": "hot"
  },
  {
    "id": "1jvhde2",
    "title": "Going to go through",
    "selftext": "I got drunk and was going to shoot myself a few weeks ago and passed out and ended up on a 72 hour hold. Later tried to hang myself but the rope broke and i woke up awhile late. Today sheriffs arrived at my door to evicte me but I got a days reprieve to leave. I can't do it anymore so I bought a stronger rope and have everything waiting.  I'm sorry to my family and my dog but I can't see a way out of the hole.  Chronic illness, mental illness and lack of hope. Truly sorry for the hurt and pain I've caused others",
    "score": 4,
    "upvotes": 4,
    "num_comments": 0,
    "created_datetime": "2025-04-09 21:30:21",
    "subreddit": "suicidewatch",
    "category": "hot"
  },
  {
    "id": "1juy9iv",
    "title": "Is it possible to die overnight from smashing/banging my head against the wall or with my hand.",
    "selftext": "I just want to give myself brain trauma to the point where I can just hope to die in my sleep even if it means I have to deal with the symptoms from brain trauma.",
    "score": 76,
    "upvotes": 76,
    "num_comments": 39,
    "created_datetime": "2025-04-09 05:21:19",
    "subreddit": "suicidewatch",
    "category": "hot"
  }
]